emacs/.emacs.d/jasper-emacs.org
#+title: GNU Emacs 配置
#+author: Jasper Hsu
#+email: xcwhome@163.com
#+options: ':t toc:nil num:t author:t email:t H:5
#+startup: content indent
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))
#+macro: word-count (eval (count-words (point-min) (point-max)))

*最后修改时间 {{{latest-export-date}}}  {{{word-count}}}字.*


在Org文件里，写好了代码块，保存文件的时候，Org mode是不会帮你自动写入文件的（未来我们可以通过配置实现），现在，我们需要通过  =C-c C-v C-t= or =M-x org-babel-tangle= 命令来触发 tangle 这个动作。

#+begin_src emacs-lisp :tangle no :results none
(org-babel-tangle)
#+end_src

xx.el 已经写好了，但并没有生效，需要重启一下Emacs，让Emacs重新加载这个配置文件，才会生效。

*elisp代码执行* :
- =C-x C-e= ： ~eval-last-sexp~ 这是最常用的，每次都要移动光标到要运行的代码后面。
- =M-x eval-region= ：执行选中区域代码
- =M-x eval-buffer= ：执行当前缓冲区代码
- =M-x load-file <ENTER> FILE_NAME= ：执行指定文件代码
- =C-j= : 执行最近距离代码，并打印输出以当前位置
- =C-M-x= : runs the command eval-defun 执行整个代码块。写函数经常修改
  然后运行，如果每次跑到最外面去 =C-x C-e= ，就很麻烦。光标只要在运行的代码块里就行了。
- =M-:= : runs the command eval-expression
- =M-x ielm= 类似于ipython交互式运行

文本编辑：
- =C-x C-s= 文件保存


+ Website: <https://xuchangwei.com/lisp/jasper-emacs.html>
+ Git repositories:
  - GitHub: <https://github.com/jaspervincent/dotfiles>

#+toc: headlines 8 insert TOC here, with eight headline levels

* =init.el= (学习)
:PROPERTIES:
:HEADER-ARGS: :tangle no
:CUSTOM_ID: h:b17d4463-f9b0-43e7-b543-67b9a130db2e
:END:

开启学习
#+begin_src sh :tangle no :results none
  :PROPERTIES:
  :HEADER-ARGS: :tangle init.el
  :END:
#+end_src

** 安装
:PROPERTIES:
:CUSTOM_ID: h:0e90d45f-f8d6-4b1e-b32a-143e762454e8
:END:

本文emacs安装在windows环境中，使用 [[https://www.msys2.org/][msys2]] 工具安装。如安装到 =D:\msys64=, 并设置PATH变量(=D:\msys64\mingw64\bin=, =D:\msys64\usr\bin=)

更新msys2, 如下更新命令执行2遍
#+begin_src sh :tangle no :results none
  pacman -Suy
#+end_src

添加msys2右键菜单： 创建 emacs-shell.reg注册表添加如下内容，双击执行即可
#+begin_example
Windows Registry Editor Version 5.00

[HKEY_CLASSES_ROOT\Directory\Background\shell\MSYS2]
@="MSYS2 Bash Here"
"Icon"="d:\\msys64\\msys2.ico"

[HKEY_CLASSES_ROOT\Directory\Background\shell\MSYS2\command]
@="d:\\msys64\\msys2_shell.cmd -mingw64 -here"
#+end_example


*** 二进制安装
:PROPERTIES:
:CUSTOM_ID: h:f9b3ea3c-a220-4130-9b15-7f85c2037540
:END:

安装emacs
#+begin_src sh :tangle no :results none
pacman -S mingw-w64-x86_64-emacs
#+end_src

*** 源码安装
:PROPERTIES:
:CUSTOM_ID: h:04da44fe-12b5-4de9-afc1-126ff7ecfc15
:END:

- https://savannah.gnu.org/projects/emacs/ (官方地址，推荐)
- https://github.com/emacs-mirror/emacs (github镜像)

下载源码，查看INSTALL文件中不同操作系统安装指引

*windows*
nt/INSTALL.W64

参考：<https://eason0210.github.io/post/install-gccemacs/>

在 Mingw64 终端中执行以下命令安装依赖。
#+begin_src sh :tangle no :results none
pacman -S --needed base-devel \
mingw-w64-x86_64-toolchain \
mingw-w64-x86_64-xpm-nox \
mingw-w64-x86_64-gmp \
mingw-w64-x86_64-gnutls \
mingw-w64-x86_64-libtiff \
mingw-w64-x86_64-giflib \
mingw-w64-x86_64-libpng \
mingw-w64-x86_64-libjpeg-turbo \
mingw-w64-x86_64-librsvg \
mingw-w64-x86_64-libwebp \
mingw-w64-x86_64-lcms2 \
mingw-w64-x86_64-libxml2 \
mingw-w64-x86_64-zlib \
mingw-w64-x86_64-harfbuzz \
mingw-w64-x86_64-libgccjit \
mingw-w64-x86_64-sqlite3 \
mingw-w64-x86_64-tree-sitter
#+end_src

下载 Emacs 源代码
#+begin_src sh :tangle no :results none
git clone -b master git://git.sv.gnu.org/emacs.git
cd emacs

#如果执行./autogen.sh过程中出错，可能是因为克隆代码后 checkout 时用了 CRLF.
git config core.autocrlf false
#+end_src

编译 Emac
#+begin_src sh :tangle no :results none
./autogen.sh  #如果提示版本不够 pacman -Su autoconf
./configure --prefix=/d/programs/emacs --without-dbus

echo $(nproc)

make -j4
make install
#make install prefix=/d/opt/emacs #指定安装目录
#+end_src
1. ~echo $(nproc)~ 会显示当前系统的 CPU 核心数；然后在 ~make -j4~ 就是使用 4 个核心进行编译, 推荐使用总数的一半，既提高了编译速度，也不影响其他应用的运行。
2. 如果需要卸载的话在源码目录里面 ~make uninstall~ 就可以了。建议安装在指定目录，注意在路径中使用斜杠"/", 而不是反斜杠"\"。
3. 如果编译过程出错了，记得 ~make clean~ 之后重新 ~configure~ 再 ~make~ 。

测试运行 Emacs

=bin\runemacs.exe -Q=

从 mingw64 shell 外部运行 Emacs 时，您需要
将 d：\msys64\mingw64\bin 添加到您的 Windows PATH，或复制所需的
DLL 添加到 Emacs 的 bin/ 目录中。 否则，TLS 等功能会导致
取决于那些DLL将丢失

将 =d:\programs\emacs\bin= 加入到环境变量。 如果和msys2中的emacs同存，将path中的源码安装的路径放在msys2的emacs前面。

创建快捷方式

请右键选择新建快捷方式，选择bin\runemacs.exe, 并起个名。 右键快捷方式 =属性= ，目标处添加命令行选项 =--debug-init= 


追加参数启动 --debug-init



** 改键
:PROPERTIES:
:CUSTOM_ID: h:learn-key
:END:

模块化配置中添加了键绑定[[#h:basic-default][(=init-basic.el= 一些默认的配置)]]


- M(eta)：统一对应键盘按键(PC/Mac)：left windows/option
- s(uper)：统一对应键盘按键(PC/Mac)：left Alt/command
- C(trl)：统一对应键盘按键(PC/Mac): Caps Lock

Mac 只需要改大写键，Windows 对齐mac的布局
- MacOS :: 在 MacOS 中, 大家可以在 =system= -> =keyboard= ->  =function
  al keys= 中调整所有功能键的键位.

1.Windows SharpKeys 改键

来把 Left Window 键改成 Left Alt 键，Left Alt 键改成 A
pp 键，大小写键改成 Ctrl 键。


官方下载：<https://github.com/randyrants/sharpkeys>，安装后 win 菜单搜
索 sharpkey，修改完成后写入注册表重新开机生效。

| 原键                 | 目标键               | 说明               |
| Caps Lock(00_3A)    | Left Ctrl(01_1D)    | 大小写键改成Ctrl键  |
| Left Alt(00_38)     | Application(E0_5D)  | 左Alt键改成App键    |
| Left Windows(E0_5B) | Left Alt(00_38)     | 左视窗键改成左Alt键 |
| Right Alt(E0_38)    | Left Windows(E0_5B) | 右Alt键改成左视窗键 |


2.配置

Emacs 默认 Alt 键就是 Meta，而 App 键我们改成 super 键，可以通过下面 的 Elisp 代码来完成。

window 配置
#+begin_src emacs-lisp
(setq w32-apps-modifier 'super)       ; 通过SharpKeys改成了 Application
#+end_src

mac 配置
#+begin_src emacs-lisp :tangle no :results none
;;  Opt -> meta : M, Cmd -> super : s
(setq mac-option-modifier 'meta
      mac-command-modifier 'super)
#+end_src

3.定义常用操作

现在我们可以把 Mac 下面的复制、粘贴、剪切、全选等命令移植到 Emacs 中
来了，并且这一套按键是跨平台的。

#+begin_src emacs-lisp
(global-set-key (kbd "s-a") 'mark-whole-buffer) ;;对应Windows上面的Ctrl-a 全选
(global-set-key (kbd "s-c") 'kill-ring-save) ;;对应Windows上面的Ctrl-c 复制
(global-set-key (kbd "s-s") 'save-buffer) ;; 对应Windows上面的Ctrl-s 保存
(global-set-key (kbd "s-v") 'yank) ;对应Windows上面的Ctrl-v 粘贴
(global-set-key (kbd "s-z") 'undo) ;对应Windows上面的Ctrol-z 撤销
#+end_src

** 常用配置
:PROPERTIES:
:CUSTOM_ID: h:b8400296-41de-4401-98c6-094756c3ee53
:END:

1.光标移动

光标的移动是编辑器中最常用的操作所以必须熟知。

- C-f 为前移一个字符， f 代表 forward。
- C-b 为后移一个字符， b 代表 backward。
- C-p 为上移至前一行， p 代表 previous。
- C-n 为上移至下一行， n 代表 next。
- C-a 为移至行首， a 代表 ahead。
- C-e 为移至行尾， e 代表 end。

同样适用于 Shell 终端里面。

2.内置功能

Emacs 功能强大，但是部分功能默认情况下并未开启。

如编辑器内显示行号可使用 M-x linum-mode 来开启。

配置文件
#+begin_src emacs-lisp
(global-display-line-numbers-mode 1) ;显示行号 29版本。29之前用(global-linum-mode 1)
(setq inhibit-startup-screen t) ; 尝试关掉启动界面
#+end_src

3.帮助

Emacs 是一个富文档编辑器（Self document, extensible editor）而下面的三种方法在学 习 Emacs 的过程中也非常重要。他们分别是，

C-h k 寻找快捷键的帮助信息
C-h v 寻找变量的帮助信息
C-h f 寻找函数的帮助信息

4.windows 右键菜单添加 Open With Emacs 功能

创建注册表文件 emacs-context.reg

#+begin_src sh :tangle no :results none
Windows Registry Editor Version 5.00

[HKEY_CLASSES_ROOT\*\shell]
[HKEY_CLASSES_ROOT\*\shell\openwemacs]
@="&Edit with Emacs"
[HKEY_CLASSES_ROOT\*\shell\openwemacs\command]
@="D:\\msys64\\mingw64\\bin\\emacsclientw.exe -n \"%1\""
[HKEY_CLASSES_ROOT\Directory\shell\openwemacs]
@="Edit &with Emacs"
[HKEY_CLASSES_ROOT\Directory\shell\openwemacs\command]
@="D:\\msys64\\mingw64\\bin\\emacsclientw.exe -n \"%1\""
#+end_src


使用这个 OpenWithEmacs 的功能，Emacs 需要开启 Server Mode，代码如下：
#+begin_src emacs-lisp
(server-mode 1)
#+end_src

双击注册文件。这时右键打开文件就可以选择emacs打开了。

5.补全
<<h:learn-completion-built-in>>

在我的配置中添加内置补全[[#h:completion-built-in][(=init-completion.el= 内置补全)]]

#+begin_src emacs-lisp
;; 内置补全功能n
;;(setq tab-always-indent 'complete)           ;; 使用 TAB 来列出当前补全选项
;;(icomplete-mode t)                         ;; 开启的，在按 M-x 时就有可选的选项了。使用 vertico-mode，关闭此项
#+end_src

6.基础Elisp

Emacs Lisp 是世界上第二古老高级编程语言 Lisp 专为 Emacs 打造的方言。官方提供了 Emacs Lisp 的[[https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html][入门]]介绍和[[https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html][参考手册]]。

#+begin_src emacs-lisp :tangle no :results none
;; 2 + 2
(+ 2 2)

;; 2 + 3 * 4
(+ 2 (* 3 4))

;; 定义变量
(setq name "username")
(message name) ; -> "username"

;; 定义函数
(defun func ()
  (message "Hello, %s" name))

;; 执行函数
(func) ; C-x C-e -> Hello, username

;; 设置快捷键
(global-set-key (kbd "<f1>") 'func)

;; 使函数可直接被调用可添加 (interactive)
(defun func ()
  (interactive)
  (message "Hello, %s" name))
#+end_src

定义f4快速打开配置文件
#+begin_src emacs-lisp
;; 快速打开配置文件
(defun open-init-file()
  (interactive)
  (find-file "~/.emacs.d/init.el"))

;; 这一行代码，将函数 open-init-file 绑定到 <f4> 键上
(global-set-key (kbd "<f4>") 'open-init-file)
#+end_src

7.外观配置
<<h:learn-ui-built-in>>

我的模块化配置[[#h:ui-built-in][(=init-ui.el= 内置配置)]]

#+begin_src emacs-lisp
;;(toggle-frame-maximized)                   ; 全屏编辑器
(tool-bar-mode -1)                           ; 关闭工具栏，tool-bar-mode 即为一个 Minor Mode
(scroll-bar-mode -1)                         ; 关闭文件滑动控件
;; (menu-bar-mode -1)                        ; 关闭菜单栏 (不关闭，使用插件时会用到)

(setq-default cursor-type 'bar)              ; 更改光标的样式，默认比较粗. 更多C-h v 查询帮助
;;(setq cursor-type 'bar)                    ; 更改光标的样式。setq当前buffer生效，不能全局生效

;;(set-face-attribute 'default nil :height 150) ; 修改字号，大小为16pt
;;让鼠标滚动更好用。默认滚动很快
(setq mouse-wheel-scroll-amount '(3 ((shift) . 1) ((control) . nil)))
(setq mouse-wheel-progressive-speed nil)

(global-hl-line-mode t)                      ;; 高亮当前行
(setq make-backup-files nil)                 ; 关闭文件自动备份。如果是有git来管理文件，备份文件没有太大意义。~ 为后缀的文件为自动生成的备份文件
(setq auto-save-default nil)   ; 关闭自动保存文件，#为后缀的文件
(fset 'yes-or-no-p 'y-or-n-p)                ;; 某个命令时需要输入 (yes or no) 
#+end_src

** 关于 lexical binding
:PROPERTIES:
:CUSTOM_ID: h:4a222504-05b5-4a0d-80ab-6cd04ee213a5
:END:

#+begin_src emacs-lisp :tangle no :results none
;; 默认没有激活。在文件最开头添加文件作用域的变量设置，设置变量的绑定方式。设置在当前文件作用域内是激活的。
;; -*- lexical-binding: t -*-
(let ((x 1))    ; x is lexically bound.
  (+ x 3))
     ⇒ 4       ; 1 + 3 的值为 4

(defun getx ()
  x)            ; x is used free in this function.

(let ((x 1))    ; x is lexically bound. getx 是用不到 let 定义的 x 的
  (getx))
;;error→ Symbol's value as variable is void: x
#+end_src

关于[[https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html][lexical binding]]更多的细节，可以自行阅读 Emacs 的官方文档。程序代码使用 lexical binding 会更利于并发，编辑器会执行一些优化让代码执行的更快。很多插件要求安装 lexical binding。

范例：init.el
#+begin_src emacs-lisp :tangle no :results none
;;; init.el --- Load the full configuration -*- lexical-binding: t -*-
;;; Commentary:

;; This file bootstraps the configuration, which is divided into
;; a number of other files.

;;; Code:

(+ 1 2)

;;; init.el ends here
#+end_src

三个分号开头的注释表示“节”，两个分号开头的注释表示“段落”。（一个分号开头的是一行代码后面的行内注释）。

** 插件源
:PROPERTIES:
:CUSTOM_ID: h:ef17a11a-df61-41c6-8bbd-8d92766b4273
:END:

#+begin_src emacs-lisp
(require 'package)
(setq package-check-signature nil 
      load-prefer-newer t) ;; 个别时候会出现签名校验失败
(setq package-archives
          '(("melpa"  . "https://melpa.org/packages/")
            ("gnu"    . "https://elpa.gnu.org/packages/")
            ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

(unless (bound-and-true-p package--initialized)
  (package-initialize)) ;; 刷新软件源索引

;;防止反复调用 package-refresh-contents 会影响加载速度
(when (not package-archive-contents)
  (package-refresh-contents))

;;modeline上显示我的所有的按键和执行的命令
(package-install 'keycast) ;包会安装在elpa目录中
(keycast-mode-line-mode t)
#+end_src

** 安装补全插件
:PROPERTIES:
:CUSTOM_ID: h:6483447a-d63f-42b0-8c5c-48eebe7d352c
:END:

*Company插件*
<<h:learn-completion-company>>

我的emacs模块配置[[#h:completion-company][(=init-completion.el= 补全 =company=)]]

他是一个用于代码补全的插件

#+begin_src emacs-lisp
;; 开启全局 Company 补全
(package-install 'company)
(global-company-mode 1)

;; company mode 默认选择上一条和下一条候选项命令 M-n M-p
(define-key company-active-map (kbd "C-n") 'company-select-next)
(define-key company-active-map (kbd "C-p") 'company-select-previous)
#+end_src

*增强 minibuffer 补全：vertico 和 Orderless*
<<h:learn-completion-minibuffer-1>>

- 我的emacs模块配置[[#h:completion-orderless][(=init-completion.el= minibuffer增强 =orderless=)]]
- 我的emacs模块配置[[#h:completion-vertico][(=init-completion.el= minibuffer增强 =vertico=)]]

#+begin_src emacs-lisp
(package-install 'vertico)
(vertico-mode t)

(package-install 'orderless)
(setq completion-styles '(orderless))
#+end_src

有了 vertico-mode，把之前的 icomplete-mode 关掉。 补全变为垂直，垂直对于我们是更友好的，所有 minibuffer 的行为的可以补全。如使用 =M-x= 补全变为垂直,  =C-x C-f= 增强显示目录下文件、 =C-x b= 变为垂直。

orderless 支持 =M-x= 模糊搜索，可以无序的。 如 edebug-defun 函数搜索， =M-x fun debug=


*配置 Marginalia 增强 minubuffer 的 annotation*
<<h:learn-completion-minibuffer-2>>

我的emacs模块配置[[#h:completion-marginalia][(=init-completion.el=  minubuffer增强注释 =marginalia=)]]

#+begin_src emacs
(package-install 'marginalia)
(marginalia-mode t)
#+end_src

=M-x= 可以看到它会把命令的注释直接显示在minibuffer中

=C-h v= 查看一个变量的内容，可以发现不用再按回车看到里面的值。直接显示在minibuffer中

=C-h f= 键位绑定都已经在minibuffer中显示出来了

=C-x C-f= 显示文件大小权限等， =C-x b= 显 buffer 大小状态， =C-h f= 显示函数快捷键等

*minibuffer action 和自适应的 context menu：Embark*
<<h:learn-completion-minibuffer-3>>

我的emacs模块配置[[#h:completion-embark][(=init-completion.el= minibuffer增强 =embark=)]]

#+begin_src emacs-lisp
(package-install 'embark)
(global-set-key (kbd "C-;") 'embark-act)
(setq prefix-help-command 'embark-prefix-help-command)
#+end_src

使用

光标在函数位置，按 =C-;= 
- RET 查看光标处函数定义文件位置，并打开
- c 修改变量的值
  - 如 C-h v 变量名，按 C-; c 修改变量的值

优点：不需要记快捷键了
- 以前查看函数的绑定键
  - ~C-h b~ 查看函数快捷键绑定：
  - 以前按 =C-x C-h= 时，会告诉你 =C-x= 绑定了哪些快捷键
- 设置了 =(setq prefix-help-command #'embark-prefix-help-command)= 后
  - 按 =C-x C-h= 模糊输入函数名可看到绑定的快捷键，按回车可直接执行命令，就不需要再记快捷键了

*增强文件内搜索和跳转函数定义：Consult*
<<h:learn-completion-minibuffer-4>>

我的emacs模块配置[[#h:completion-consult][(=init-completion.el= 增强文件内搜索 =consult=)]]

#+begin_src emacs-lisp
(package-install 'consult)
;;replace swiper 可以替代老的 ivy mode 的 swiper 功能
(global-set-key (kbd "C-s") 'consult-line)
(global-set-key (kbd "M-s i") 'consult-imenu)  ;跳转函数定义
#+end_src

使用 =C-s= 搜索的内容就会在minibuffer中垂直显示，使用C-p 或 C-n来上下选择

使用 =M-s i= 跳转函数定义或者org-mode标题

这些组合可以秒杀ivy helm这种一统的插件。

*括号*

#+begin_src emacs-lisp
(electric-pair-mode t)                       ; 括号补全
(add-hook 'prog-mode-hook #'show-paren-mode) ;; 编程模式下，光标在括号上时高亮另一个括号
#+end_src

** 手工安装插件
:PROPERTIES:
:CUSTOM_ID: h:a10e6f11-2517-4c48-bcb7-5ee139fa2a2c
:END:

以 [[https://github.com/manateelazycat/awesome-tab][awesome-tab]]  为例

创建目录，使用内容Dir包。 =C-x d= 回车， =+= 创建目录输入目录名site-lisp 回车， =q= 退出

使用 =M-x eshell= 克隆代码
#+begin_src sh :tangle no :results none
cd site-lisp
git clone --depth=1 https://github.com/manateelazycat/awesome-tab.git
#+end_src

配置文件
#+begin_src emacs-lisp :tangle no :results none
(add-to-list 'load-path (expand-file-name "~/.emacs.d/site-lisp/awesome-tab/"))
(require 'awesome-tab)
(awesome-tab-mode t)

;;(use-package awesome-tab
;;  :ensure nil
;;  :quelpa (awesome-tab :fetcher github :repo "manateelazycat/awesome-tab" :upgrade nil)
;;  :init (awesome-tab-mode t)
;;  )

(defun awesome-tab-buffer-groups ()
"`awesome-tab-buffer-groups' control buffers' group rules.
Group awesome-tab with mode if buffer is derived from `eshell-mode' `emacs-lisp-mode' `dired-mode' `org-mode' `magit-mode'.
All buffer name start with * will group to \"Emacs\".
Other buffer group by `awesome-tab-get-group-name' with project name."
(list
(cond
    ((or (string-equal "*" (substring (buffer-name) 0 1))
	(memq major-mode '(magit-process-mode
			    magit-status-mode
			    magit-diff-mode
			    magit-log-mode
			    magit-file-mode
			    magit-blob-mode
			    magit-blame-mode)))
    "Emacs")
    ((derived-mode-p 'eshell-mode)
    "EShell")
    ((derived-mode-p 'dired-mode)
    "Dired")
    ((memq major-mode '(org-mode org-agenda-mode diary-mode))
    "OrgMode")
    ((derived-mode-p 'eaf-mode)
    "EAF")
    (t
    (awesome-tab-get-group-name (current-buffer))))))
#+end_src

尽量用内置的包。 =tab-bar=

