emacs/.emacs.d/jasper-emacs.org
** =early-init.el= 对启动时间和垃圾回收的调整
:PROPERTIES:
:CUSTOM_ID: h:d5de6908-9c6e-4fdd-8d06-4059f170abfd
:END:

#+begin_src emacs-lisp :tangle "early-init.el"
(setq gc-cons-threshold (* 50 1000 1000))
#+end_src

** =early-init.el= 初始化包缓存
:PROPERTIES:
:CUSTOM_ID: h:package-cache
:END:


这里使用标准的 =package.el= 来管理我的Emacs包。
([[#h:package.el][=init.el= 配置软件包]])


* Emacs主配置文件 (=init.el=)
:PROPERTIES:
:CUSTOM_ID: h:84a797ae-9cef-4eb4-8144-4423d96d57d7
:END:

#+begin_src emacs-lisp :tangle "init.el"
;;; init.el --- The main init entry for Emacs -*- lexical-binding: t -*-
;;; Commentary:

;; This file bootstraps the configuration, which is divided into
;; a number of other files.

;;; Code:


#+end_src

** =init.el= 加载前自定义配置
:PROPERTIES:
:CUSTOM_ID: h:b5675d8d-07b5-4cc1-bb53-2e13d63c652d
:END:

*** =init.el= 判断操作系统
:PROPERTIES:
:CUSTOM_ID: h:307ea5c9-d0cb-4458-8c72-fe27e44a52ba
:END:
#+begin_src emacs-lisp :tangle "init.el"
;;; 判断操作系统， 定义一个新变量
(setq *is-a-mac* (eq system-type 'darwin))
(setq *win64* (eq system-type 'windows-nt))
(setq *cygwin* (eq system-type 'cygwin) )
(setq *linux* (or (eq system-type 'gnu/linux) (eq system-type 'linux)) )
(setq *unix* (or *linux* (eq system-type 'usg-unix-v) (eq system-type 'berkeley-unix)) )
#+end_src

** =init.el= 基础配置禁用备份和锁定文件
:PROPERTIES:
:CUSTOM_ID: h:8a5ac6bd-d9f2-43f8-b0a4-64c758a747aa
:END:

默认情况下，Emacs 会尝试锁定文件，以免它们被其他程序修改。它还保留备份。这些是我不需要的功能

#+begin_src emacs-lisp :tangle "init.el"
;;; 禁用备份和锁定文件
(setq make-backup-files nil)
(setq backup-inhibited nil) ; Not sure if needed, given `make-backup-files'
(setq create-lockfiles nil)
#+end_src

** =init.el= 指定自定义文件 custom.el
:PROPERTIES:
:CUSTOM_ID: h:10a19e0f-2d8a-4e63-b394-f8eadd628aea
:END:

默认情况下，Emacs 将持久自定义写入用户的 init 文件末尾。当用户 =M-x customize= 或与之相关时，Emacs 都会写这些内容。指定自定义文件位置与init.el区分开。

#+begin_src emacs-lisp :tangle "init.el"
;;; 指定自己义配置
(setq custom-file (make-temp-file "emacs-custom-")) ;没有则自动创建emacs-custom-开头随机文件
(load custom-file 'no-error 'no-message)
#+end_src

** =init.el= 始终从 =*scratch*= 缓冲区开始
:PROPERTIES:
:CUSTOM_ID: h:fdc495f8-e664-4284-a21d-bd34d0c39823
:END:

#+begin_src emacs-lisp :tangle "init.el"
;;; 始终从 *scratch* 缓冲区开始
(setq initial-buffer-choice t)
#+end_src

** =init.el= 加载目录
:PROPERTIES:
:CUSTOM_ID: h:i-dir
:END:


加载目录下所有配置
- =list= 目录 :: 各种插件配置
- =person= 目录 :: 个人的配置

在 =init.el= 配置中调用插件[[#h:i-modules][(=init.el= 加载各模块)]]
  

#+begin_src emacs-lisp :tangle "init.el"
;;; 加载目录
(mapc
 (lambda (string)
   (add-to-list 'load-path (locate-user-emacs-file string)))
 '("lisp" "j-lisp"))
#+end_src

** =init.el= 软件包 (=package.el=)
:PROPERTIES:
:CUSTOM_ID: h:package.el
:END:

package.el 内置于 Emacs 中。我们不需要显式加载它，在需要时会被 use-package 调用。
early-init.el 处激活缓存[[#h:package-cache][(=early-init.el= 初始化包缓存)]]

#+begin_src emacs-lisp :tangle "init.el"
;;; 软件包
(setq package-vc-register-as-project nil) ; Emacs 30

;; 设置插件源优先级
(require 'package)
(setq package-check-signature nil 
      load-prefer-newer t) ;; 个别时候会出现签名校验失败
(setq package-archives
      '(("gnu-elpa" . "https://elpa.gnu.org/packages/")
        ("gnu-elpa-devel" . "https://elpa.gnu.org/devel/")
        ("nongnu" . "https://elpa.nongnu.org/nongnu/")
        ("melpa" . "https://melpa.org/packages/")))

;; 最大的数字优先（未提及的优先级为 0）
(setq package-archive-priorities
      '(("gnu-elpa" . 3)
        ("melpa" . 2)
        ("nongnu" . 1)))

(unless (bound-and-true-p package--initialized)
  (package-initialize)) ;; 刷新软件源索引

;;防止反复调用 package-refresh-contents 会影响加载速度
(when (not package-archive-contents)
  (package-refresh-contents))
#+end_src

强制指定某些软件的源
#+begin_src emacs-lisp :tangle "init.el"
(defvar j-emacs-my-packages
  '(vertico tmr)
  "List of symbols representing the packages I develop/maintain.")

;; 指定某些软件使用特点源安装 
(setq package-pinned-packages
      `(,@(mapcar
           (lambda (package)
             (cons package "gnu-elpa-devel"))
           j-emacs-my-packages)))
#+end_src

*** =init.el= use-pacakge 插件
:PROPERTIES:
:CUSTOM_ID: h:4e302b04-678d-492a-941e-5cc805b8f8a2
:END:

29版本后内置包


#+begin_src emacs-lisp :tangle "init.el"
;; make use-package default behavior better
;; with `use-package-always-ensure' you won't need ":ensure t" all the time
;; with `use-package-always-defer' you won't need ":defer t" all the time
;; (setq use-package-always-ensure t           ; 自动安装
;;      use-package-always-defer t            ; 软件包延迟加载 
;;      use-package-enable-imenu-support t
;;      use-package-expand-minimally t)
#+end_src

使用样例
#+begin_src emacs-lisp :tangle no
;;; xxx包
(use-package xxx
  :ensure nil                          ; 确认安装，nil表示不需要安装。nil 可配置内置包。
  :pin melpa                           ; 指向插件源
  :defer nil                           ; 是否要延迟加载
  :demand nil                          ; 是否立即执行，t 即忽略延迟加载
  :diminish (flymake " Flym.")         ; 状态栏显示的样式
  :after yasnippet                     ; 别的包安装后启动. 多个包用括号括起来(abc ddd)
  :custom                              ; 相当于(setq <key> <value>)
  (ivy-use-virtual-buffers t)
  :hook                                 ; hook模式的绑定
  (prog-mode . flycheck-mode)
  :commands (isearch-moccur isearch-all)    
  :init                                ; 在加载插件前执行一些命令
  (setq smooth-scrolling-margin 2)
  :config                              ; 在加载插件后执行一些命令
  (smooth-scrolling-mode t)
  :bind                                 ; 快捷键的绑定，全局
  (("<f2>" . xx) ("M-p" . xx2))
  :bind                                 ; 指定映射绑定, bind可以写多个 
  ( :map global-map
    ("<insert>" . nil)
    ("<menu>" . nil)
    ("C-z" . nil) ; I have a window manager, thanks!
    ("C-x C-z" . nil) ; same idea as above
    ("M-`" . nil)
    ("M-SPC" . cycle-spacing)
    ("M-=" . count-words)
    :map prog-mode-map          
    ("c" . rainbow-mode)
    ))
#+end_src

** =init.el= 加载各个模块
:PROPERTIES:
:CUSTOM_ID: h:i-modules
:END:

我把配置拆分为几个模块[[#h:i-dir][(=init.el= 加载目录)]]

各个模块都记录在下面[[#h:modules][我的 Emacs 模块配置]]中


#+begin_src emacs-lisp :tangle "init.el"
;; 加载模块
(load (locate-user-emacs-file "jasper-emacs-pre-custom.el") :no-error :no-message)

;; Packages
(require 'init-packages)
(use-package benchmark-init
  :ensure t
  :demand t
  :config
  ;; To disable collection of benchmark data after init is done.
  (add-hook 'after-init-hook 'benchmark-init/deactivate))

;; Core
(require 'init-ui)
(require 'init-essentials)
(require 'init-basic)
(require 'init-modeline)
(require 'init-completion)
(require 'init-evil)
(require 'init-tools)
;; uis
(require 'init-window)
;; Tools
(require 'init-org)
;; Frameworks
(require 'init-persp)
;; Languages
(require 'init-programming)
;; personal
(require 'init-keybindings)
(require 'init-funcs)

(load (locate-user-emacs-file "jasper-emacs-post-custom.el") :no-error :no-message)
#+end_src

** =init.el= 计算启动时间
:PROPERTIES:
:CUSTOM_ID: h:048fe6a9-b02a-46fd-8907-78c8c3366234
:END:

#+begin_src emacs-lisp :tangle "init.el"
(defun efs/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                   (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'efs/display-startup-time)


(setq gc-cons-threshold (* 2 1000 1000))
#+end_src


* 我的Emacs模块配置(=lisp/=)
:PROPERTIES:
:CUSTOM_ID: h:modules
:END:

=init.el= 部分中，通过 ~load-path~ 让 Emacs 可以运行他们的代码[[#h:i-dir][(=init.el= 加载目录)]]。本章的副标题定义了模块，每个模块都加载在我的 =init.el= 末尾调用[[#h:i-modules][(=init.el= 加载各模块)]]

** =init-packages.el=
:PROPERTIES:
:CUSTOM_ID: h:20c90145-9293-4c6e-9ac5-7cd73353ed70
:END:

#+begin_src emacs-lisp :tangle "lisp/init-packages.el" :mkdirp yes
;;; config
#+end_src

*** =init-packages.el= 安装 quelpa 插件
:PROPERTIES:
:CUSTOM_ID: h:packages-quelpa
:END:

在学习章节提到过[[h:learn-module-up-packages][(精选 packages, 大大提升你的 Emacs 编辑效率)]]

emacs30版本提供vc内置包，拉取非elpa源软件包

#+begin_comment :tangle no
,#+begin_src emacs-lisp :tangle no :results none
#+end_comment

#+begin_src emacs-lisp :tangle "lisp/init-packages.el"
;;(use-package quelpa :ensure t)
(use-package quelpa
  :ensure t
  :commands quelpa
  :config
  :custom
  (quelpa-git-clone-depth 1)
  (quelpa-update-melpa-p nil)
  (quelpa-self-upgrade-p nil)
  (quelpa-checkout-melpa-p nil))
(use-package quelpa-use-package
  :ensure t
  :init
  (setq quelpa-use-package-inhibit-loading-quelpa t)
  :demand t)

(unless (package-installed-p 'quelpa-use-package)
  (quelpa
   '(quelpa-use-package
     :fetcher git
     :url "https://github.com/quelpa/quelpa-use-package.git")))
#+end_src

*** =ini-package.el= vc =package-vc.el=
:PROPERTIES:
:CUSTOM_ID: h:packages-vc
:END:

https://github.com/slotThe/vc-use-package

emacs30版本后vc内置。可以直接使用。

#+begin_src emacs-lisp :tangle no
;;; 添加vc宏方便安装非elpa源包
(require 'cl-lib)
(require 'use-package-core)

(cl-defun slot/vc-install (&key (fetcher "github") repo name rev backend)
  (let* ((url (format "https://www.%s.com/%s" fetcher repo))
         (iname (when name (intern name)))
         (package-name (or iname (intern (file-name-base repo)))))
    (unless (package-installed-p package-name)
      (package-vc-install url iname rev backend))))

(defvar package-vc-use-package-keyword :vc)

(defun package-vc-use-package-set-keyword ()
  (unless (member package-vc-use-package-keyword use-package-keywords)
    (setq use-package-keywords
          (let* ((pos (cl-position :unless use-package-keywords))
                 (head (cl-subseq use-package-keywords 0 (+ 1 pos)))
                 (tail (nthcdr (+ 1 pos) use-package-keywords)))
            (append head (list package-vc-use-package-keyword) tail)))))

(defun use-package-normalize/:vc (name-symbol keyword args)
  (let ((arg (car args)))
    (pcase arg
      ((or `nil `t) (list name-symbol))
      ((pred symbolp) args)
      ((pred listp) (cond
                     ((listp (car arg)) arg)
                     ((string-match "^:" (symbol-name (car arg))) (cons name-symbol arg))
                     ((symbolp (car arg)) args)))
      (_ nil))))

(defun use-package-handler/:vc (name-symbol keyword args rest state)
  (let ((body (use-package-process-keywords name-symbol rest state)))
    ;; This happens at macro expansion time, not when the expanded code is
    ;; compiled or evaluated.
    (if args
        (use-package-concat
         `((unless (package-installed-p ',(pcase (car args)
                                            ((pred symbolp) (car args))
                                            ((pred listp) (car (car args)))))
             (apply #'slot/vc-install ',(cdr args))))
         body)
      body)))

(defun package-vc-use-package-override-:ensure (func name-symbol keyword ensure rest state)
  (let ((ensure (if (plist-member rest :vc)
                    nil
                  ensure)))
    (funcall func name-symbol keyword ensure rest state)))

(defun package-vc-use-package-activate-advice ()
  (advice-add
   'use-package-handler/:ensure
   :around
   #'package-vc-use-package-override-:ensure))

(defun package-vc-use-package-deactivate-advice ()
  (advice-remove
   'use-package-handler/:ensure
   #'package-vc-use-package-override-:ensure))

;; register keyword on require
(package-vc-use-package-set-keyword)
#+end_src


样例：
#+begin_src emacs-lisp :tangle no
(use-package org-roam-ui
  :ensure nil
  :vc (:fetcher "github" :repo "org-roam/org-roam-ui"))
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-packages.el"
(message "Load init-packages done...")
(provide 'init-packages)
#+end_src

** =init-ui.el=
:PROPERTIES:
:CUSTOM_ID: h:1a9f33d6-5ff3-4048-872d-80243061b6cb
:END:

*** =init-ui.el= 内置配置
:PROPERTIES:
:CUSTOM_ID: h:ui-built-in
:END:

在学习章节提到过[[h:learn-ui-built-in][(外观配置)]]

#+begin_src emacs-lisp :tangle "lisp/init-ui.el" :mkdirp yes
(setq inhibit-startup-screen t) ; 尝试关掉启动界面
(setq-default cursor-type 'bar)              ; 更改光标的样式，默认比较粗. 更多C-h v 查询帮助
;;(setq cursor-type 'bar)                    ;; 更改光标的样式。setq当前buffer生效，不能全局生效

(global-hl-line-mode t)                      ;; 高亮当前行

(global-display-line-numbers-mode 1) ;显示行号 29版本。29之前用(global-linum-mode 1)
(setq frame-title-format
      `((buffer-file-name "%f" "%b")
        ,(format " - GNU Emacs %s" emacs-version)))


;;(toggle-frame-maximized)                     ; 全屏编辑器
(setq  initial-frame-alist (quote ((fullscreen . maximized))))


;;(set-face-attribute 'default nil :height 150) ; 修改字号，大小为16pt
;;让鼠标滚动更好用。默认滚动很快
(setq mouse-wheel-scroll-amount '(3 ((shift) . 1) ((control) . nil)))
(setq mouse-wheel-progressive-speed nil)

(tool-bar-mode -1)                           ;; 关闭工具栏，tool-bar-mode 即为一个 Minor Mode
(scroll-bar-mode -1)                         ;; 关闭文件滑动控件
;; (menu-bar-mode -1)                        ;; 关闭菜单栏 (不关闭，使用插件时会用到)


;;主题
;;(load-theme 'tango-dark) ;这里使用doom-theme


#+end_src

*** =init-ui.el= 主题 =doom-emacs=
:PROPERTIES:
:CUSTOM_ID: h:ui-doom-emacs
:END:

在我的学习文章提到过([[#h:0ef565c4-904d-4863-9c8b-7462407b2659][模块列表]])

#+begin_src emacs-lisp :tangle no :results none
;; 这里的执行顺序非常重要，doom-modeline-mode 的激活时机一定要在设置global-mode-string 之后‘
(use-package doom-themes
  :ensure t)
(load-theme 'doom-one 1)

(use-package doom-modeline
  :ensure t
  :custom-face
  (mode-line ((t (:height 0.9))))
  (mode-line-inactive ((t (:height 0.9))))
  :init
  (doom-modeline-mode t))

(use-package nerd-icons
  :ensure t)
#+end_src

现在更推荐用 [[https://github.com/rainstormstudio/nerd-icons.el][rainstormstudio/nerd-icons.el (github.com)]] 。直接下载一个nerd fonts就可以 (=M-x nerd-icons-install-fonts=)或者手动下载fonts目录中的 =NFM.ttf= 。GUI和terminal都可以显示icon，大小也更统一。

#+begin_src emacs-lisp :tangle "lisp/init-ui.el"
;; 这里的执行顺序非常重要，doom-modeline-mode 的激活时机一定要在设置global-mode-string 之后‘
(use-package doom-themes
  :ensure t
  :init
  (if (display-graphic-p)
      (load-theme 'doom-solarized-light t) ; t表示自动确认运行代码
    (load-theme 'doom-tomorrow-night t)))

;; (set-face-attribute 'default nil :height 150) ; 修改字号，大小为16pt
(set-face-attribute 'default nil :height 130) ; 修改字号，大小为16pt

(use-package doom-modeline
  :ensure t
  :init
  (setq doom-modeline-minor-modes t)
  :custom-face
  (mode-line ((t (:height 0.95))))
  (mode-line-inactive ((t (:height 0.95))))
  :hook (after-init . doom-modeline-mode))
#+end_src


#+begin_src emacs-lisp :tangle "lisp/init-ui.el"
(message "Load init-ui done...")
(provide 'init-ui)
#+end_src

** =init-essentials.el=
:PROPERTIES:
:CUSTOM_ID: h:8c9e81fb-48a0-41da-b9e0-1e3cfdee7f51
:END:


#+begin_src emacs-lisp :tangle "lisp/init-essentials.el" :mkdirp yes
;;;; 常规设置和常用自定义函数(j-simple.el)
#+end_src

*** =init-essentials.el= 自定义命令 =j-simple.el=
:PROPERTIES:
:CUSTOM_ID: h:d5590309-993e-442e-93ac-e0a6d11763af
:END:


自定义命令([[#h:1ff292d7-21a0-4f9b-a00d-52a6be5ef3f6][ =j-simple.el= 库]])
#+begin_src emacs-lisp :tangle "lisp/init-essentials.el"
(use-package j-simple
  :ensure nil
  :demand t
  :bind
  ( ("ESC ESC" . j-simple-keyboard-quit-dwim)
    ("C-g" . j-simple-keyboard-quit-dwim)
    ("C-M-SPC" . j-simple-mark-sexp)   ; 选中区域
    ))
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-essentials.el"
(message "Load init-essentials done...")
(provide 'init-essentials)
#+end_src

** =init-basic.el=
:PROPERTIES:
:CUSTOM_ID: h:eeccf037-bcb1-4a96-b965-0339735c3105
:END:
