emacs/.emacs.d/jasper-emacs.org
*** =init-basic.el= 一些默认的配置
:PROPERTIES:
:CUSTOM_ID: h:basic-default
:END:

这里涉及到改键[[#h:learn-key][(改键)]]

#+begin_src emacs-lisp :tangle "lisp/init-basic.el" :mkdirp yes
;;; 一些默认的配置
;;;
(setq w32-apps-modifier 'super)       ;PC 通过SharpKeys改成了 Application

(global-set-key (kbd "s-a") 'mark-whole-buffer) ;;对应Windows上面的Ctrl-a 全选
(global-set-key (kbd "s-c") 'kill-ring-save) ;;对应Windows上面的Ctrl-c 复制
(global-set-key (kbd "s-s") 'save-buffer) ;; 对应Windows上面的Ctrl-s 保存
(global-set-key (kbd "s-v") 'yank) ;对应Windows上面的Ctrl-v 粘贴
(global-set-key (kbd "s-z") 'undo) ;对应Windows上面的Ctrol-z 撤销

;; 查询函数、变量、key 定义的文件位置
(global-set-key (kbd "C-h C-f") 'find-function)
(global-set-key (kbd "C-h C-v") 'find-variable)
(global-set-key (kbd "C-h C-k") 'find-function-on-key)

;; 设置系统的编码，避免各处的乱码
;; UTF-8 as the default coding system
(when (fboundp 'set-charset-priority)
  (set-charset-priority 'unicode))
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(setq default-buffer-file-coding-system 'utf-8)

;; emoji
;; (set-fontset-font "fontset-default"
;;                   'unicode
;;                   (font-spec :family "Segoe UI Emoji" :size 12))

;;; emoji表情符号
;; Noto Emoji Font 是google开源项目https://fonts.google.com/noto/specimen/Noto+Emoji
;; Segoe UI Emoji 字体 https://www.freefontdownload.org/ch/segoe-ui-emoji.font
;; 下载所有表情符号
;; MacOS
;;(set-fontset-font t 'symbol (font-spec :family "Apple Color Emoji") nil 'prepend)
;; Windows
(when (eq system-type 'windows-nt)
  (set-frame-font "Segoe UI Emoji-12" nil t))

;; 开启服务
(server-mode 1)

(electric-pair-mode t)                       ; 括号补全
(add-hook 'prog-mode-hook #'show-paren-mode) ; 编程模式下，光标在括号上时高亮另一个括号
(delete-selection-mode t)                    ; 选中文本后输入文本会替换文本（更符合我们习惯了的其它编辑器的逻辑。默认选中放后面

(global-auto-revert-mode t)                  ; 自动加载外部修改过的文件
(setq auto-save-default nil)                 ; 关闭自动保存文件，#为后缀的文件
(setq ring-bell-function 'ignore)            ; 关闭提示声音
(fset 'yes-or-no-p 'y-or-n-p)                ;; 某个命令时需要输入 (yes or no)
#+end_src

*** =init-basic.el= 最近编辑过的文件 =recentf=
:PROPERTIES:
:CUSTOM_ID: h:3bd70b80-cd07-4c49-b8c0-202f525a46d6
:END:

#+begin_src emacs-lisp :tangle "lisp/init-basic.el"
;;; 最近编辑过的文件
(use-package recentf
  :ensure nil
  :bind (("C-x C-r" . recentf-open-files))
  :hook (after-init . recentf-mode)
  :init (setq recentf-max-saved-items 300
              recentf-exclude
              '("\\.?cache" ".cask" "url" "COMMIT_EDITMSG\\'" "bookmarks"
                "\\.\\(?:gz\\|gif\\|svg\\|png\\|jpe?g\\|bmp\\|xpm\\)$"
                "\\.?ido\\.last$" "\\.revive$" "/G?TAGS$" "/.elfeed/"
                "^/tmp/" "^/var/folders/.+$" "^/ssh:" "/persp-confs/"
                (lambda (file) (file-in-directory-p file package-user-dir))))
  :config
  (push (expand-file-name recentf-save-file) recentf-exclude)
  (add-to-list 'recentf-filename-handlers #'abbreviate-file-name))
#+end_src

*** =init-basic.el= 历史命令 =savehist=
:PROPERTIES:
:CUSTOM_ID: h:basic-session
:END:

在我的学习文章提到过([[#h:0ef565c4-904d-4863-9c8b-7462407b2659][模块列表]])

savehist-mode  默认开启，重启 emacs 会记住使用过的命令，同时会保存到 =~/.emacs.d/history= 文件中。 history 文件还保存了 minibuffer 的变量、查找过的文件等。相当于记住了上次的工作状态。

save-place-mode 开启后，会记住光标所在文件的位置，下次打开文件时自动光标指向这个位置


#+begin_src emacs-lisp :tangle "lisp/init-basic.el"
;;; Save and restore editor sessions between restarts
;; 记住使用过的命令
(use-package savehist
  :ensure nil
  :hook (after-init . savehist-mode)
  :init (setq enable-recursive-minibuffers t ; Allow commands in minibuffers
              history-length 1000
              savehist-additional-variables '(mark-ring
                                              global-mark-ring
                                              search-ring
                                              regexp-search-ring
                                              extended-command-history)
              savehist-autosave-interval 300)
  )

;; 记住光标所在文件的位置
(use-package saveplace
  :ensure nil
  :hook (after-init . save-place-mode)) ;在emacs配置完全加载好以后，执行save-place-mode
#+end_src

测试：
- 记住光标的位置，重启emacs
- =C-x C-f= 重新打开该文件，可以看到光标是上次退出的位置。

*** =init-basic.el= 内置包 =simple=
:PROPERTIES:
:CUSTOM_ID: h:basic-simple
:END:

在我的学习文章提到过([[#h:0ef565c4-904d-4863-9c8b-7462407b2659][模块列表]])

modeline上显示文件大小、列号

#+begin_src emacs-lisp :tangle "lisp/init-basic.el"
;;; modeline上显示文件大小、 列号
(use-package simple
  :ensure nil
  :hook (after-init . size-indication-mode)
  :init
  (progn
    (setq column-number-mode t)
    ))
#+end_src

*** =init-basic.el= 键位绑定 =general=
:PROPERTIES:
:CUSTOM_ID: h:basic-general
:END:

在自定义evil键位绑定用到[[#h:evil-custom-keybinding][(=init.evil.el= 自定义快捷键)]]

#+begin_src emacs-lisp :tangle "lisp/init-basic.el"
;;; 自定义类似evil中的leader键
(use-package general
  :ensure t
  :init
  ;; 针对evil插件。设置了一些类似leader键的函数. 如 leader 为空格对应函数global-definer , leader 为逗号对应函数global-leader
  (with-eval-after-load 'evil
    (general-add-hook 'after-init-hook
                      (lambda (&rest _)
                        (when-let ((messages-buffer (get-buffer "*Messages*")))
                          (with-current-buffer messages-buffer
                            (evil-normalize-keymaps))))
                      nil
                      nil
                      t))


  (general-create-definer global-definer
    :keymaps 'override
    :states '(insert emacs normal hybrid motion visual operator)
    :prefix "SPC"
    :non-normal-prefix "C-SPC")

  ;; 定义一个宏。这个宏的作用是继承global-dfiner函数的leader键SPC空格，接收一个inix-key变量的值为子leader
  (defmacro +general-global-menu! (name infix-key &rest body)
    "Create a definer named +general-global-NAME wrapping global-definer.
Create prefix map: +general-global-NAME. Prefix bindings in BODY with INFIX-KEY."
    (declare (indent 2))
    `(progn
       (general-create-definer ,(intern (concat "+general-global-" name))
         :wrapping global-definer
         :prefix-map ',(intern (concat "+general-global-" name "-map"))
         :infix ,infix-key
         :wk-full-keys nil
         "" '(:ignore t :which-key ,name))
       (,(intern (concat "+general-global-" name))
        ,@body)))

  (general-create-definer global-leader
    :keymaps 'override
    :states '(emacs normal hybrid motion visual operator)
    :prefix ","
    "" '(:ignore t :which-key (lambda (arg) `(,(cadr (split-string (car arg) " ")) . ,(replace-regexp-in-string "-mode$" "" (symbol-name major-mode)))))))
#+end_src

键位绑定示例：
#+begin_src emacs-lisp :tangle no
(use-package general
  :init
  (general-emacs-define-key 'global [remap imenu] 'consult-imenu)
  (general-emacs-define-key 'global [remap apropos] 'consult-apropos)
  (global-definer
    "!" 'shell-command)

  (+general-global-menu! "search" "s"
    "p" 'consult-ripgrep)

  (+general-global-menu! "buffer" "b"
    "d" 'kill-current-buffer)
#+end_src


python-mode
#+begin_src emacs-lisp :tangle no
(use-package python
  :ensure t
  :hook (inferior-python-mode . (lambda ()
                                  (process-query-on-exit-flag
                                   (get-process "Python"))))
  :init
  ;; Disable readline based native completion
  (setq python-shell-completion-native-enable nil)
  :config
  (global-leader
    :major-modes
    '(python-mode t)
    ;;and the keymaps:
    :keymaps
    '(python-mode-map)
    "e" 'live-py-set-version)
  (setq python-shell-interpreter "python3")

  ;; Live Coding in Python
  (use-package live-py-mode))
#+end_src

rust-mode
#+begin_src emacs-lisp :tangle no
(global-leader
  :major-modes
  '(rust-mode t)
  ;;and the keymaps:
  :keymaps
  '(rust-mode-map)
  "=" 'rust-format-buffer
  "c" 'rust-compile
  "r" 'rust-run
  "t" 'rust-test)
#+end_src

org-mode
#+begin_src emacs-lisp :tangle no
;; mode specific major key
(global-leader
  :major-modes
  '(org-mode t)
  ;;and the keymaps:
  :keymaps
  '(org-mode-map)
  "p" 'org-pomodoro
  "t" 'org-todo
  "e" 'org-set-effort)

(global-leader
  :major-modes
  '(org-agenda-mode t)
  ;;and the keymaps:
  :keymaps
  '(org-agenda-mode-map)
  "d" 'org-agenda-day-view
  "w" 'org-agenda-week-view
  "," 'org-agenda-priority
  "e" 'org-agenda-set-effort
  ":" 'org-agenda-set-tags
  "T" 'org-agenda-show-tags
  "p" 'org-pomodoro)
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-basic.el"
(message "Load init-basic done...")
(provide 'init-basic)
#+end_src

*** =init-basic.el= 输入法
:PROPERTIES:
:CUSTOM_ID: h:basic-input
:END:

**** =init-basic.el= 输入法 =pyim=
:PROPERTIES:
:CUSTOM_ID: h:a7b816c8-da82-4210-856e-07e2edd6e2c2
:END:

在学习章节提到过[[#h:learn-tools-search-pinyin][(使用拼音进行搜索)]]

#+begin_src emacs-lisp :tangle "lisp/init-basic.el"
;;; 输入法 (pyim)
(use-package pyim
  :ensure t)
#+END_SRC

** =init-modeline.el=
:PROPERTIES:
:CUSTOM_ID: h:800b1175-68ac-43cc-a556-6c4e0d2eccbc
:END:


#+begin_src emacs-lisp :tangle "lisp/init-modeline.el" :mkdirp yes
;;; config
#+end_src

*** =init-modeline.el= 按键显示 =keycast=
:PROPERTIES:
:CUSTOM_ID: h:modeline-keycast
:END:

在我的学习文章提到过([[#h:0ef565c4-904d-4863-9c8b-7462407b2659][模块列表]])

modeline上显示我的所有的按键和执行的命令

#+begin_src emacs-lisp :tangle no :results none
;;; modeline上显示我的所有的按键和执行的命令
(use-package keycast
  :ensure t
  :init (keycast-mode-line-mode 1)) ; 在标题显示
#+end_src

在使用doom-modeline上面配置会报错。这里用下面的配置


#+begin_src emacs-lisp :tangle no
(use-package keycast
  :ensure t
  :config
  (define-minor-mode keycast-mode
    "Show current command and its key binding in the mode line (fix for use with doom-mode-line)."
    :global t
    (if keycast-mode
        (add-hook 'pre-command-hook 'keycast--update t)
      (remove-hook 'pre-command-hook 'keycast--update)))
  (add-to-list 'global-mode-string '("" mode-line-keycast)))
#+end_src

我的配置如下
#+begin_src emacs-lisp :tangle "lisp/init-modeline.el"
(use-package keycast
  :ensure t
  :commands (+toggle-keycast)
  :config
  (defun +toggle-keycast()
    (interactive)
    (if (member '("" keycast-mode-line " ") global-mode-string)
        (progn (setq global-mode-string (delete '("" keycast-mode-line " ") global-mode-string))
               (remove-hook 'pre-command-hook 'keycast--update)
               (message "Keycast OFF"))
      (add-to-list 'global-mode-string '("" keycast-mode-line " "))
      (add-hook 'pre-command-hook 'keycast--update t)
      (message "Keycast ON"))))
  ;; 这里的执行顺序非常重要，doom-modeline-mode 的激活时机一定要在设置global-mode-string 之后
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-modeline.el"
(message "Load init-modeline done...")
(provide 'init-modeline)
#+end_src

