emacs/.emacs.d/jasper-emacs.org
*** =init-evil.el= 安装
:PROPERTIES:
:CUSTOM_ID: h:evil-init
:END:


#+begin_src emacs-lisp :tangle no :results none
;;; evil 
(use-package evil
  :ensure t
  :init
  (setq evil-want-keybinding nil) ;不使用自带的键位绑定。默认加载不同模式下键位绑定
  (setq evil-want-C-u-scroll t) ;C-u 实现向上滚动。默认C-u 是emacs中的功能
  (evil-mode)

  ;; https://emacs.stackexchange.com/questions/46371/how-can-i-get-ret-to-follow-org-mode-links-when-using-evil-mode
  (with-eval-after-load 'evil-maps
    (define-key evil-motion-state-map (kbd "RET") nil)) ;如果有链接，按回车能访问这个链接
  )
#+end_src


安装undo-tree
#+begin_src emacs-lisp :tangle no :results none
  ;;; evil 使用undo-tree来管理undo redo
  (use-package undo-tree
    :ensure t
    :diminish
    :init
    (global-undo-tree-mode 1)
    (setq undo-tree-auto-save-history nil)
    (evil-set-undo-system 'undo-tree))
#+end_src

*Emacs中使用vim和外部使用vim的区别*

vim 中有normal和insert模式，在emacs中是各种state, 如 noarmal state, insert state

- Normal State (N) :: 这是 Evil 默认的“静止状态”，其中定义了 vi 绑定的主体。 =M-x evil-normal-state=

- Insert State (I) :: 这是插入文本的状态，其中未修改的键将在缓冲区中插入相应的字符。

- Emacs State (E) :: 一种尽可能接近默认 Emacs 行为的状态，通过 =C-z= 从emacs和 vi 相互切换。

- Visual State (V) :: 用于选择文本区域的状态。

- Motion State (M) 运动状态 （M） :: 一种特殊状态，适用于只读缓冲区，其中运动可用，但编辑操作不可用。只读的文档一般都是Motion state 如帮助文档。 =M-x evil-motion-state=

- Replace State (R) 替换状态 （R） :: 一种特殊状态，与插入状态非常相似，只不过它替换文本而不是插入。 按住大写的 =R= , 一直替换状态


*Evil 基础用法*

增删改查 (text-obj, commands, replace)
- text-obj 更好地操作文本
  - 选中单词 viw
  - 删除单词 diw
- 跳到r字符的位置： fr
- commands
  - =:= 进行命令行模式。 :%s/commands/111/ 可以替换, 按 u 回退 
    
evil-guide: <https://github.com/noctuid/evil-guide.git>

上述文档花2小时认真读就可以完全从vim用户切到emacs上使用了。


*interactive replace 交互式替换文本*

在学习章节提到过[[h:learn-module-up-packages][(精选 packages, 大大提升你的 Emacs 编辑效率)]]

交互式替换文本. 在evil模式中，选中的单词填写在 =:%s/<word>//= 中

#+begin_src emacs-lisp :tangle no :results none
;;;###autoload
(defun my/evil-quick-replace (beg end )
  (interactive "r")
  (when (evil-visual-state-p)
    (evil-exit-visual-state)
    (let ((selection (regexp-quote (buffer-substring-no-properties beg end))))
      (setq command-string (format "%%s /%s//g" selection))
      (minibuffer-with-setup-hook
          (lambda () (backward-char 2))
        (evil-ex command-string)))))

(define-key evil-visual-state-map (kbd "C-r") 'my/evil-quick-replace)
#+end_src

交互式替换文本操作：
- =SPC v= 或者选中要替换的字符串，按 =C-r= 替换

比较全的evil配置
#+begin_src emacs-lisp :tangle "lisp/init-evil.el" :mkdirp yes
;;; evil 
(use-package evil
  :ensure t
  :init
  (setq evil-want-keybinding nil) ;不使用自带的键位绑定。默认加载不同模式下键位绑定
  (setq evil-want-C-u-scroll t) ;C-u 实现向上滚动。默认C-u 是emacs中的功能
  (evil-mode)

  ;; https://emacs.stackexchange.com/questions/46371/how-can-i-get-ret-to-follow-org-mode-links-when-using-evil-mode
  (with-eval-after-load 'evil-maps
    (define-key evil-motion-state-map (kbd "RET") nil)) ;如果有链接，按回车能访问这个链接

  ;;; 自定义设置
  ;; 在进行插入模式后，希望使用emacs的快捷键，而又不希望进入 Emacs State
  (setcdr evil-insert-state-map nil)
  (define-key evil-insert-state-map [escape] 'evil-normal-state) ;按 [Esc] 回到normal state. 下面会介绍更方便的evil-escape插件

  ;; 加空行, 默认 o + Esc 需要2次操作. 下面的设置直接在normal 模式中操作
  (define-key evil-normal-state-map (kbd "[ SPC") (lambda () (interactive) (evil-insert-newline-above) (forward-line))) ; 向上加空行
  (define-key evil-normal-state-map (kbd "] SPC") (lambda () (interactive) (evil-insert-newline-below) (forward-line -1))) ; 向上加空行

  ;; 在normal state中切换不同的buffer
  (define-key evil-normal-state-map (kbd "[ b") 'previous-buffer) ;切到前一个buffer
  (define-key evil-normal-state-map (kbd "] b") 'next-buffer)
  (define-key evil-motion-state-map (kbd "[ b") 'previous-buffer)
  (define-key evil-motion-state-map (kbd "] b") 'next-buffer)

  ;; 在dired模式下，添加快捷键
  (evil-define-key 'normal dired-mode-map ; 只修改dired模式下normal模式的快捷键绑定
    (kbd "<RET>") 'dired-find-alternate-file
    (kbd "C-k") 'dired-up-directory ;往上一级目录
    "`" 'dired-open-term
    "q" 'quit-window ; q 退出。默认没有。 可以查看emacs state下的q绑定的函数 =C-x d= 进入dired， =C-z= 进入emacs state， =C-h k= 按 q 可查到对应的函数为 quit-window
    "o" 'dired-find-file-other-window ; 在另外一个窗口打开文件
    "z" 'dired-get-size
    ")" 'dired-omit-mode)
  )


(use-package j-evil
  :ensure nil
  :bind
  ( :map evil-visual-state-map 
  ("C-r" . my/evil-quick-replace) ;交互式替换文本 选中文本C-r, :%s/<words>//
  ))

;;; evil 使用undo-tree来管理undo redo
(use-package undo-tree
  :ensure t
  :diminish
  :init
  (global-undo-tree-mode 1)
  (setq undo-tree-auto-save-history nil)
  (evil-set-undo-system 'undo-tree))
#+end_src

*** =init.evil.el= 自定义快捷键
:PROPERTIES:
:CUSTOM_ID: h:evil-custom-keybinding
:END:


*定义不同 state 下面的快捷键*


#+begin_src emacs-lisp :tangle no :results none
;;; 自定义设置
;; 在进行插入模式后，希望使用emacs的快捷键，而又不希望进入 Emacs State
(setcdr evil-insert-state-map nil)
(define-key evil-insert-state-map [escape] 'evil-normal-state) ;按 [Esc] 回到normal state

;; 加空行, 默认 o + Esc 需要2次操作. 下面的设置直接在normal 模式中操作
(define-key evil-normal-state-map (kbd "[ SPC") (lambda () (interactive) (evil-insert-newline-above) (forward-line))) ; [ + 空格，向上加空行
(define-key evil-normal-state-map (kbd "] SPC") (lambda () (interactive) (evil-insert-newline-below) (forward-line -1))) ; [ + 空格，向上加空行

;; 在normal state中切换不同的buffer
(define-key evil-normal-state-map (kbd "[ b") 'previous-buffer) ; [ + b 切到前一个buffer
(define-key evil-normal-state-map (kbd "] b") 'next-buffer)
(define-key evil-motion-state-map (kbd "[ b") 'previous-buffer)
(define-key evil-motion-state-map (kbd "] b") 'next-buffer)

;; 在dired模式下，添加快捷键
(evil-define-key 'normal dired-mode-map ; 只修改dired模式下normal模式的快捷键绑定
  (kbd "<RET>") 'dired-find-alternate-file
  (kbd "C-k") 'dired-up-directory ;往上一级目录
  "`" 'dired-open-term
  "q" 'quit-window ; q 退出。默认没有。 可以查看emacs state下的q绑定的函数 =C-x d= 进入dired， =C-z= 进入emacs state， =C-h k= 按 q 可查到对应的函数为 quit-window
  "o" 'dired-find-file-other-window ; 在另外一个窗口打开文件
  "z" 'dired-get-size
  ")" 'dired-omit-mode)
#+end_src


*spacemacs like 快捷键如何定义*

general插件中global-definer在init-basic.el中定义[[#h:basic-general][(=init-basic.el= 键位绑定 =general=)]]

#+begin_src emacs-lisp :tangle no :results none
(use-package general
  :init
  ;; global-definer 对应leader键为空格
  (global-definer
    "!" 'shell-command ;空格+! SPC ! 进入shell命令行
    "SPC" 'execute-extended-command ; 按2下空格SPC-SPC就可以实现 M-x 的效果
    "'" 'vertico-repeat
    "+" 'text-scale-increase
    "-" 'text-scale-decrease
    "u" 'universal-argument ;SPC u 相当于emacs的C-u 
    "hdf" 'describe-function ;SPC hdf 相当于emacs的C-h f
    "hdv" 'describe-variable ;SPC hdv 相当于emacs的C-h v
    "hdk" 'describe-key ;SPC hdk 相当于emacs的C-h k
    ;; 查看init-funcs.el 自定义函数
    "hh" 'my/highlight-dwim ;SPC hh 高亮选中区域并标上颜色
    "hc" 'my/clearn-highlight ;SPC hc 清除高亮颜色
    "v" 'er/expand-region ;SPC v 扩大区域
    )
  ;; leader 键为SPC空格，子leader键为b. 如 SPC b b查看buffer缓冲区
  (+general-global-menu! "buffer" "b"
    "d" 'kill-current-buffer
    "b" '(consult-buffer :which-key "consult buffer") ; 查看buffer缓冲区
    "B" 'switch-to-buffer
    "p" 'previous-buffer
    "R" 'rename-buffer
    "M" '((lambda () (interactive) (switch-to-buffer "*Messages*")) 
          :which-key "messages-buffer") ; SPC b M查看*Message*缓冲区
    "n" 'next-buffer
    "i" 'ibuffer
    "f" 'my-open-current-directory
    "k" 'kill-buffer

    "y" 'copy-buffer-name
    "K" 'kill-other-buffers)
  )
#+end_src

我的emacs模块配置[[#h:keybindings-general][(=init-keybindings.el= 键位绑定 =general=)]]

参考配置： https://github.com/zilongshanren/emacs.d/blob/eglot/lisp/init-keybindings.el 实现自己的文件、窗口、项目多种快捷键绑定

*** 相关插件列表
:PROPERTIES:
:CUSTOM_ID: h:36d15ff2-87fc-47f2-a385-ddca88f7c2f0
:END:

**** evil-escape插件回退到normal state
:PROPERTIES:
:CUSTOM_ID: h:2186eba8-72bf-4c04-b439-168680e1055e
:END:

任何状态下按 =kj= 就能回到normal state。很实用，相当于把esc键集中在右手, 一只手就可以操作vim常用功能。
#+begin_src emacs-lisp :tangle "lisp/init-evil.el"
;; kj 退回到普通模式
(use-package evil-escape
  :ensure t
  :init
  ;; {{ https://github.com/syl20bnr/evil-escape
  (setq-default evil-escape-delay 0.3)
  (setq evil-escape-excluded-major-modes '(dired-mode))
  (setq-default evil-escape-key-sequence "kj")
  ;; disable evil-escape when input method is on
  (evil-escape-mode 1)
  ;; }}
)
#+end_src

**** evil-anzu
:PROPERTIES:
:CUSTOM_ID: h:ff29f09d-cec5-488a-a62e-2e96a9327958
:END:

小功能ui。 当用 =Shift *= 查找单词重复出现几次时，下方状态栏会多一个标识显示，显示当前重复出现单词的位置和总重复次数。
#+begin_src emacs-lisp :tangle "lisp/init-evil.el"
;;下方状态栏显示单词重复出现位置
(use-package evil-anzu
  :ensure t
  :after evil
  :diminish
  :demand t
  :init
  (global-anzu-mode t))
#+end_src

**** evil-collections
:PROPERTIES:
:CUSTOM_ID: h:4ab86f63-e3dc-4b10-a730-72d12d10555a
:END:

使用社区的按键绑定。相对稳定不会改变

同时可以设置不同模式中默认的evil状态

#+begin_src emacs-lisp :tangle "lisp/init-evil.el"
;;; 使用社区稳定的按键绑定。 并设置不同模式中默认的evil状态
(use-package evil-collection
  :ensure t
  :after evil
  :config
  (setq evil-collection-mode-list (remove 'lispy evil-collection-mode-list)) ; 移除社区中插件的改键对你键位影响
  (evil-collection-init)

  ;; 设置进入mode时对应的vim 模式
  (cl-loop for (mode . state) in
           '((org-agenda-mode . normal) ;进入agenda时默认Normal State状态
             (Custom-mode . emacs)
             (eshell-mode . emacs) ;进入eshell模式时默认Emacs State状态
             (makey-key-mode . motion))
           do (evil-set-initial-state mode state)))
#+end_src

**** evil-surround
:PROPERTIES:
:CUSTOM_ID: h:efec661d-88ef-4d35-8545-e33a71e60c04
:END:

S用法，选中一个单词后加引号。
- =viw S "= 相当于原生vim text object用法 =viw Shift i "= 操作 

#+begin_src emacs-lisp :tangle "lisp/init-evil.el"
;;; S用法，选中一个单词后加引号。viw S " 相当于原生vim text object用法 viw Shift i " 
(use-package evil-surround
  :ensure t
  :init
  (global-evil-surround-mode 1))
#+end_src

**** evil-nerd-commenter
:PROPERTIES:
:CUSTOM_ID: h:5748be0d-f8c4-45d6-89c0-3fd42e880a2c
:END:

对不同语言加的注释

#+begin_src emacs-lisp :tangle "lisp/init-evil.el"
;;; 添加不同语言的注释
(use-package evil-nerd-commenter
  :ensure t
  :init
  ;; normal 或 visual 模式下按 ,/ 可加注释
  ;; (define-key evil-normal-state-map (kbd ",ci") 'evilnc-comment-or-uncomment-lines)
  (define-key evil-normal-state-map (kbd ",/") 'evilnc-comment-or-uncomment-lines)
  (define-key evil-visual-state-map (kbd ",") 'evilnc-comment-or-uncomment-lines)
  )
#+end_src

操作：加注释
- 单行注释， =,/=
- 多行注释，选中行 =,/=

**** evil-snipe
:PROPERTIES:
:CUSTOM_ID: h:c63ca6bf-d489-49a3-90b9-0826c2bc5f20
:END:

小功能ui。高亮查找的字符。 如查找m字符。 =fm= 当前行的m字符高亮。按 =;= 重复查找动作
#+begin_src emacs-lisp :tangle "lisp/init-evil.el"
(use-package evil-snipe
  :ensure t
  :diminish
  :init
  (evil-snipe-mode +1)
  (evil-snipe-override-mode +1))
#+end_src

**** evil-matchit
:PROPERTIES:
:CUSTOM_ID: h:270a82c8-9426-4829-b6b8-2037a2121fdf
:END:

按 =%= 可以在函数、括号之间跳转

参考我的文章[[http://xuchangwei.com/lisp/coding-emacs/coding-emacs.html#h:vscode-symbol-jump][(如何提高编程速度)]]

#+begin_src emacs-lisp :tangle "lisp/init-evil.el"
;;; 按 % 可以在函数、括号之间跳转
(use-package evil-matchit
  :ensure
  :init
  (global-evil-matchit-mode 1))
#+end_src

*** 高阶用法（自定义 text-obj 或者 自定义 commands)
:PROPERTIES:
:CUSTOM_ID: h:78a0a60e-dfaf-4aeb-9f4d-6bbaefd6ae1d
:END:

- https://github.com/noctuid/evil-guide#modes
- https://evil.readthedocs.io/en/latest/overview.html


#+begin_src emacs-lisp :tangle "lisp/init-evil.el"
(message "Load init-evil done...")
(provide 'init-evil)
#+end_src

*我的建议*

使用emacs原生按键。 用多了evil，你还是个vim用户，无法轻松操作无配置或精简内置配置的emacs。

** =init-tools.el=
:PROPERTIES:
:CUSTOM_ID: h:b9b5d584-8a46-49ab-91c7-94c1503a12f5
:END:

*** =init-tools.el= 多光标操作 =iedit= & =evil-multiedit=
:PROPERTIES:
:CUSTOM_ID: h:tools-iedit
:END:

在学习章节提到过[[h:learn-module-up-packages][(精选 packages, 大大提升你的 Emacs 编辑效率)]]

此插件需要配合着evil插件使用。

#+begin_src emacs-lisp :tangle "lisp/init-tools.el" :mkdirp yes
;;; 多光标操作 iedit & evil-multiedit
(use-package iedit
  :ensure t
  :init
  (setq iedit-toggle-key-default nil)
  :config
  (define-key iedit-mode-keymap (kbd "M-h") 'iedit-restrict-function)
  (define-key iedit-mode-keymap (kbd "M-i") 'iedit-restrict-current-line))

(use-package evil-multiedit
  :ensure t
  :commands (evil-multiedit-default-keybinds)
  :init
  (evil-multiedit-default-keybinds))
#+end_src

edit操作：
- evil normal 状态下，选中单词 =viw= 再按 =R=. 进入 =evil-multiedit= 模式。 这时选中区域高亮，同时下方状态栏显示单词出现次数和当前所在位置
- 在 =evil-multiedit= 模式下，使用vim方式操作。如
  - =gg= 到匹配单词的第一次出现位置; =大G= 到匹配单词的最后一个; 按 =0= 光标跳到当前匹单词的开头
  - =i= 插入模式输入字符，所有匹配的单词跟着一直修改
  - esc 回到normal模式，按 =C-g= 退出edit模式

*** =init-tools.el= 快速选中区域 =expand-region=
:PROPERTIES:
:CUSTOM_ID: h:tools-expand-region
:END:

在学习章节提到过[[h:learn-module-up-packages][(精选 packages, 大大提升你的 Emacs 编辑效率)]]

快速选中区域

#+begin_src emacs-lisp :tangle "lisp/init-tools.el"
(use-package expand-region
  :ensure t
  :config
  ;; 定义子菜单
  (defadvice er/prepare-for-more-expansions-internal
      (around helm-ag/prepare-for-more-expansions-internal activate)
    ad-do-it
    (let ((new-msg (concat (car ad-return-value)
                           ", H to highlight in buffers"
                           ", / to search in project, "
                           "e iedit mode in functions"
                           "f to search in files, "
                           "b to search in opened buffers"))
          (new-bindings (cdr ad-return-value)))
      (cl-pushnew  ; 高亮
       '("H" (lambda ()
               (interactive)
               (call-interactively
                'my/highlight-dwim))) ;自定库j-highlight-global
       new-bindings)
      (cl-pushnew ; 查找当前项目(git项目)目录中匹配选中字符串的文件
       '("/" (lambda ()
               (interactive)
               (call-interactively
                'my/search-project-for-symbol-at-point))) ;自定库j-expand-region
       new-bindings)
      (cl-pushnew ; 等同于evil multiedit 中 R 操
       '("e" (lambda ()
               (interactive)
               (call-interactively
                'evil-multiedit-match-all)))
       new-bindings)
      (cl-pushnew
       '("f" (lambda ()
               (interactive)
               (call-interactively
                'find-file)))
       new-bindings)
      (cl-pushnew  ; 搜索选中的字符
       '("b" (lambda ()
               (interactive)
               (call-interactively
                'consult-line)))
       new-bindings)
      (setq ad-return-value (cons new-msg new-bindings)))))


(use-package j-expand-region
  :ensure nil)
#+end_src

扩大缩小区域操作：
- 选中字符或光标位置
- =M-x er/expand-region= 扩大区域。 回车回车扩大； - 减号缩小区域；0 重置 /查找
- 在expand-region下，又自定义快捷键绑定可以方便操作。

添加一个快捷键[[#h:keybindings-general][(=init-keybindings.el= 键位绑定 =general=)]]，让标记和搜索功能更方便[[#h:j-expand-region][(=j-expand-region.el= 库)]]： 

#+begin_src emacs-lisp :tangle no :results none
;;;###autoload
(defun my/search-project-for-symbol-at-point ()
  (interactive)
  (if (use-region-p)
      (progn
        (consult-ripgrep (project-root (project-current))
                         (buffer-substring (region-beginning) (region-end))))))

(global-definer
  "hc" 'my/clearn-highlight
  "hH" 'my/highlight-dwim
  "v" 'er/expand-region
  )
#+end_src

扩大区域快捷操作：
- =SPC v= 扩大区域. 之后可以使用 - 缩小区域
- =SPC v e= 等同于evil multiedit[[#h:tools-iedit][(=init-tools.el= 多光标操作 =iedit= & =evil-multiedit=)]]中的 R 操作
- =SPC v f= 调用 ~find-file~ 函数查找文件
- =SPC v /= 查找当前项目(git项目)目录中匹配选中字符串的文件[[#h:j-expand-region][(=j-expand-region.el= 库)]]
- =SPC v b= 调用 ~consult-line~ 查找当前文件中匹配选中字符串的行
- =SPC v H= 文本高亮请阅读[[#h:tools-highlight-global][(=init-tools.el= 文本高亮 =symbol-overlay= & =highlight-global=)]]
  
