emacs/.emacs.d/jasper-emacs.org
*** =init-tools.el= 文本高亮 =symbol-overlay= & =highlight-global=
:PROPERTIES:
:CUSTOM_ID: h:tools-highlight-global
:END:

在学习章节提到过[[h:learn-module-up-packages][(精选 packages, 大大提升你的 Emacs 编辑效率)]]

高亮插件

highlight-global是github插件，使用quelpa插件辅助安装[[#h:packages-quelpa][(=init-packages.el= 安装 quelpa 插)]] , 自定义了高亮函数[[#h:j-highlight-global][(=j-highlight-global.el= 库)]]做为快捷键引用[[#h:tools-expand-region][(=init-tools.el= 快速选中区域 =expand-region=)]]

#+begin_src emacs-lisp :tangle "lisp/init-tools.el"
(use-package highlight-global
  :ensure nil
  :commands (highlight-frame-toggle)
  :quelpa (highlight-global :fetcher github :repo "glen-dai/highlight-global" :upgrade nil)
  :config
  ;; 高亮默认随机红、粉、蓝、青、紫等颜色循环
  (progn
    (setq-default highlight-faces
                  '(('hi-red-b . 0)
                    ('hi-aquamarine . 0)
                    ('hi-pink . 0)
                    ('hi-blue-b . 0)))))
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-tools.el"
(use-package symbol-overlay
  :ensure t
  :config
  (define-key symbol-overlay-map (kbd "h") 'nil))
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-tools.el"
(use-package j-highlight-global
  :ensure nil)
#+end_src

高亮插件操作：
- =SPC v H= 选中部分以一种颜色高亮。重复操作可以看到不高亮颜色。
  - 场景：查找代码或日志时，标记重点区域
  - general 快捷键 =SPC v= =SPC hh=
- =M-x clear-highlight-frame= 清除颜色，或者 =SPC hc= 清除高亮颜色


#+begin_src emacs-lisp :tangle "lisp/init-tools.el"
(message "Load init-tools done...")
(provide 'init-tools)
#+end_src

** =init-window.el=
:PROPERTIES:
:CUSTOM_ID: h:window
:END:

在学习中提供过[[h:learn-window][(窗口)]]

Evil 的窗口选择操作
C-w h/j/j/k

*** =init-window.el= =window numbering=
:PROPERTIES:
:CUSTOM_ID: h:526c9704-5d7a-47e9-96ca-8310e01fa809
:END:

- <https://github.com/nschum/window-numbering.el>

#+begin_src emacs-lisp :tangle "lisp/init-window.el" :mkdirp yes
;;; 切换窗口
(use-package window-numbering
  :ensure t
  :init
  :hook (after-init . window-numbering-mode))
#+end_src

- 切换窗口 =M-<窗口编号>= 

定义快捷键
#+begin_src emacs-lisp :tangle no
(global-definer
  "0" 'select-window-0
  "1" 'select-window-1
  "2" 'select-window-2
  "3" 'select-window-3
  "4" 'select-window-4
  "5" 'select-window-5
  )

(+general-global-menu! "window" "w"
  "/" 'split-window-right
  "-" 'split-window-below
  "m" 'delete-other-windows
#+end_src

- 左右分屏 =SPC w /=
- 上下分屏 =SPC w -=
- 删除所有其他窗口 =SPC w m=

*** =init-window.el= =es-windows=
:PROPERTIES:
:CUSTOM_ID: h:98d343f7-9e3d-43b7-8402-a4b3ee20db5b
:END:

- <https://github.com/sabof/es-windows>

可以交换窗口、删除窗口、分屏
#+begin_src emacs-lisp :tangle "lisp/init-window.el"
;;; 可以交换窗口、删除窗口、分屏
(use-package es-windows
  :ensure t)
#+end_src

*** =init-window.el= =Buffer move=
:PROPERTIES:
:CUSTOM_ID: h:ec506a8e-4641-40a6-800a-a13ba8187433
:END:

- <https://github.com/nschum/window-numbering.el>

移动窗口  
#+begin_src emacs-lisp :tangle "lisp/init-window.el"
;;; config
(use-package buffer-move
  :ensure t)
#+end_src

=SPC w s= 指定交的换窗口

*** =init-window.el= =Resize windows=
:PROPERTIES:
:CUSTOM_ID: h:f27bcd87-7576-4c88-94b5-cd0c3760b649
:END:
- <https://github.com/dpsutton/resize-window>

调整窗口大小
#+begin_src emacs-lisp :tangle "lisp/init-window.el"
;;; 调整窗口大小
(use-package resize-window
  :ensure t
  :init
  (defvar resize-window-dispatch-alist
    '((?n resize-window--enlarge-down " 向下Resize - Expand down " t)
      (?p resize-window--enlarge-up " 向上Resize - Expand up" t)
      (?f resize-window--enlarge-horizontally " 放大Resize - horizontally" t)
      (?b resize-window--shrink-horizontally " 缩小Resize - shrink horizontally" t)
      (?r resize-window--reset-windows " 重置Resize - reset window layout" nil)
      (?w resize-window--cycle-window-positive "  选择分屏Resize - cycle window" nil)
      (?W resize-window--cycle-window-negative " Resize - cycle window" nil)
      (?2 split-window-below " 水平Split window horizontally" nil)
      (?3 split-window-right " 垂直Slit window vertically" nil)
      (?0 resize-window--delete-window " 删除Delete window" nil)
      (?K resize-window--kill-other-windows " Kill other windows (save state)" nil)
      (?y resize-window--restore-windows " 恢复(when state) Restore window configuration" nil)
      (?? resize-window--display-menu " Resize - display menu" nil))
    "List of actions for `resize-window-dispatch-default.
Main data structure of the dispatcher with the form:
\(char function documentation match-capitals\)"))
#+end_src

*** =init-window.el= =Winner(builtin)=
:PROPERTIES:
:CUSTOM_ID: h:ca4c214b-2e05-4d97-95cf-9fd95fd01771
:END:

内置插件。用来切换2个不同窗口布局
#+begin_src emacs-lisp :tangle "lisp/init-window.el"
;;; 内置插件。用来切换2个不同窗口布局
(use-package winner
  :ensure nil
  :commands (winner-undo winner-redo)
  :hook (after-init . winner-mode)
  :init (setq winner-boring-buffers '("*Completions*"
                                      "*Compile-Log*"
                                      "*inferior-lisp*"
                                      "*Fuzzy Completions*"
                                      "*Apropos*"
                                      "*Help*"
                                      "*cvs*"
                                      "*Buffer List*"
                                      "*Ibuffer*"
                                      "*esh command on file*")))
#+end_src

- 'winner-undo           ; SPC w u 返回布局
- 'winner-redo           ; SPC w z 撤销返回布局。 和返回布局结合实现2个布局间切换

