emacs/.emacs.d/lisp/init-window.el
  ;;; 切换窗口
  (use-package window-numbering
    :ensure t
    :init
    :hook (after-init . window-numbering-mode))

  ;;; 可以交换窗口、删除窗口、分屏
  (use-package es-windows
    :ensure t)

  ;;; config
  (use-package buffer-move
    :ensure t)

  ;;; 调整窗口大小
  (use-package resize-window
    :ensure t
    :init
    (defvar resize-window-dispatch-alist
      '((?n resize-window--enlarge-down " 向下Resize - Expand down " t)
        (?p resize-window--enlarge-up " 向上Resize - Expand up" t)
        (?f resize-window--enlarge-horizontally " 向右Resize - horizontally" t)
        (?b resize-window--shrink-horizontally " 向左Resize - shrink horizontally" t)
        (?r resize-window--reset-windows " 重置Resize - reset window layout" nil)
        (?w resize-window--cycle-window-positive "  选择分屏Resize - cycle window" nil)
        (?W resize-window--cycle-window-negative " Resize - cycle window" nil)
        (?2 split-window-below " 水平Split window horizontally" nil)
        (?3 split-window-right " 垂直Slit window vertically" nil)
        (?0 resize-window--delete-window " 删除Delete window" nil)
        (?K resize-window--kill-other-windows " Kill other windows (save state)" nil)
        (?y resize-window--restore-windows " 恢复(when state) Restore window configuration" nil)
        (?? resize-window--display-menu " Resize - display menu" nil))
      "List of actions for `resize-window-dispatch-default.
  Main data structure of the dispatcher with the form:
  \(char function documentation match-capitals\)"))

  ;;; 内置插件。用来切换2个不同窗口布局
  (use-package winner
    :ensure nil
    :commands (winner-undo winner-redo)
    :hook (after-init . winner-mode)
    :init (setq winner-boring-buffers '("*Completions*"
                                        "*Compile-Log*"
                                        "*inferior-lisp*"
                                        "*Fuzzy Completions*"
                                        "*Apropos*"
                                        "*Help*"
                                        "*cvs*"
                                        "*Buffer List*"
                                        "*Ibuffer*"
                                        "*esh command on file*")))
