emacs/.emacs.d/jasper-emacs.org
*** =init-window.el= 关闭弹窗 =Popper=
:PROPERTIES:
:CUSTOM_ID: h:7c339d63-4318-4073-b826-b7a6eca2b694
:END:

- <https://github.com/karthink/popper>

#+begin_src emacs-lisp :tangle "lisp/init-window.el"
;; Enforce rules for popups
(use-package popper
  :ensure t
  :defines popper-echo-dispatch-actions
  :commands popper-group-by-directory
  :bind (:map popper-mode-map
              ("s-`" . popper-toggle-latest)
              ("s-o"   . popper-cycle)
              ("M-`" . popper-toggle-type))
  :hook (emacs-startup . popper-mode)
  :init
  (setq popper-reference-buffers
        '("\\*Messages\\*"
          "Output\\*$" "\\*Pp Eval Output\\*$"
          "\\*Compile-Log\\*"
          "\\*Completions\\*"
          "\\*Warnings\\*"
          "\\*Flymake diagnostics.*\\*"
          "\\*Async Shell Command\\*"
          "\\*Apropos\\*"
          "\\*Backtrace\\*"
          "\\*prodigy\\*"
          "\\*Calendar\\*"
          "\\*Embark Actions\\*"
          "\\*Finder\\*"
          "\\*Kill Ring\\*"
          "\\*Embark Export:.*\\*"
          "\\*Edit Annotation.*\\*"
          "\\*Flutter\\*"
          bookmark-bmenu-mode
          comint-mode
          compilation-mode
          help-mode helpful-mode
          tabulated-list-mode
          Buffer-menu-mode
          occur-mode
          gnus-article-mode devdocs-mode
          grep-mode occur-mode rg-mode deadgrep-mode ag-mode pt-mode
          ivy-occur-mode ivy-occur-grep-mode
          process-menu-mode list-environment-mode cargo-process-mode
          youdao-dictionary-mode osx-dictionary-mode fanyi-mode

          "^\\*eshell.*\\*.*$" eshell-mode
          "^\\*shell.*\\*.*$"  shell-mode
          "^\\*terminal.*\\*.*$" term-mode
          "^\\*vterm.*\\*.*$"  vterm-mode

          "\\*DAP Templates\\*$" dap-server-log-mode
          "\\*ELP Profiling Restuls\\*" profiler-report-mode
          "\\*Flycheck errors\\*$" " \\*Flycheck checker\\*$"
          "\\*Paradox Report\\*$" "\\*package update results\\*$" "\\*Package-Lint\\*$"
          "\\*[Wo]*Man.*\\*$"
          "\\*ert\\*$" overseer-buffer-mode
          "\\*gud-debug\\*$"
          "\\*lsp-help\\*$" "\\*lsp session\\*$"
          "\\*quickrun\\*$"
          "\\*tldr\\*$"
          "\\*vc-.*\\*$"
          "\\*eldoc\\*"
          "^\\*elfeed-entry\\*$"
          "^\\*macro expansion\\**"

          "\\*Agenda Commands\\*" "\\*Org Select\\*" "\\*Capture\\*" "^CAPTURE-.*\\.org*"
          "\\*Gofmt Errors\\*$" "\\*Go Test\\*$" godoc-mode
          "\\*docker-containers\\*" "\\*docker-images\\*" "\\*docker-networks\\*" "\\*docker-volumes\\*"
          "\\*prolog\\*" inferior-python-mode inf-ruby-mode swift-repl-mode
          "\\*rustfmt\\*$" rustic-compilation-mode rustic-cargo-clippy-mode))

  (when (display-grayscale-p)
    (setq popper-mode-line
          '(:eval
            (concat
             (propertize " " 'face 'mode-line-emphasis)
             (propertize " " 'face 'mode-line-emphasis)))))

  (setq popper-echo-dispatch-actions t)
  (setq popper-group-function nil)
  :config
  (popper-echo-mode 1)

  (with-no-warnings
    (defun my-popper-fit-window-height (win)
      "Determine the height of popup window WIN by fitting it to the buffer's content."
      (fit-window-to-buffer
       win
       (floor (frame-height) 3)
       (floor (frame-height) 3)))
    (setq popper-window-height #'my-popper-fit-window-height)

    (defun popper-close-window-hack (&rest _)
      "Close popper window via `C-g'."
      ;; `C-g' can deactivate region
      (when (and (called-interactively-p 'interactive)
                 (not (region-active-p))
                 popper-open-popup-alist)
        (let ((window (caar popper-open-popup-alist)))
          (when (window-live-p window)
            (delete-window window)))))
    (advice-add #'keyboard-quit :before #'popper-close-window-hack)))
#+end_src

*按键绑定*

我的模块化配置[[#h:keybindings-general][(=init-keybindings.el= 键位绑定 =general=)]]

#+begin_src emacs-lisp :tangle no
(global-definer
  ;; 这里是其他的快捷键
  "0" 'select-window-0  ; SPC 0 切0号窗口
  "1" 'select-window-1  ; SPC 1 切1号窗口
  "2" 'select-window-2
  "3" 'select-window-3
  "4" 'select-window-4
  "5" 'select-window-5)

(+general-global-menu! "window" "w"
  "/" 'split-window-right   ; SPC w / 左右分屏
  "-" 'split-window-below   ; SPC w - 上下分屏
  "m" 'delete-other-windows ; SPC w m 仅保留当前窗口
  "u" 'winner-undo           ; SPC w u 返回布局
  "z" 'winner-redo           ; SPC w z 撤销返回布局。 和返回布局结合实现2个布局间切换
  "w" 'esw/select-window     ; SPC w w 选择分屏方式 >向右分，<向左分，^向上分，v向下分
  "s" 'esw/swap-two-windows  ; SPC w s 交换窗口 
  "d" 'esw/delete-window     ; SPC w d 删除指定窗口
  "=" 'balance-windows-area  ; SPC w = 等宽布局
  "r" 'esw/move-window
  "x" 'resize-window         ; SPC w x 调整窗口大小。如f水平变大；b缩小；n向下扩；p向上扩；
  "H" 'buf-move-left         ; SPC w H 右边窗口左移
  "L" 'buf-move-right        ; SPC w L 窗口右移
  "J" 'buf-move-down         ; SPC w J 窗口下移
  "K" 'buf-move-up)          ; SPC w K 窗口上移
#+end_src

#+begin_src emacs-lisp :tangle "lisp/init-window.el"
(message "Load init-window done...")
(provide 'init-window)
#+end_src

** =init-org.el=
:PROPERTIES:
:CUSTOM_ID: h:org
:END:

*** =init-org.el= 内置配置
:PROPERTIES:
:CUSTOM_ID: h:org-built-in
:END:

在学习章节提到过[[h:learn-org-built-in][(learn org)]]

#+begin_src emacs-lisp :tangle "lisp/init-org.el" :mkdirp yes
;;; config

(with-eval-after-load 'org  ; 启动org文件时加载
  ;; 使用旧版快捷键<s +Tab
  (require 'org-tempo)
  
  ;; 其他
  (require 'org-protocol) ; 加载内置包, 在摘取网页内容时会用到
  (setq org-image-actual-width nil) ; 内嵌图片是否显示实际宽度, 默认为t
  (setq org-return-follows-link t)  ; 链接位置回车，使用外部程序打开
  
  ;; 禁用左尖括号
  (setq electric-pair-inhibit-predicate
	`(lambda (c)
           (if (char-equal c ?\<) t (,electric-pair-inhibit-predicate c))))
  
  (add-hook 'org-mode-hook
            (lambda ()
              (setq-local electric-pair-inhibit-predicate
                          `(lambda (c)
                             (if (char-equal c ?\<) t (,electric-pair-inhibit-predicate c))))))
)
#+end_src

*** =init-org.el= 安装最新org包
:PROPERTIES:
:CUSTOM_ID: h:bd869f5d-b960-4a71-a831-455165c3b55e
:END:

#+begin_src emacs-lisp :tangle "lisp/init-org.el"
;;; 安装 org，这个配置一定要配置在 use-package 的初始化之前，否则无法正常安装
;; (assq-delete-all 'org package--builtins)
;; (assq-delete-all 'org package--builtin-versions)
;; (use-package org
;;   :pin gnu-elpa
;;   :ensure t)

(use-package org-contrib  ;非org的官方贡献的插件
  :ensure t
  :pin nongnu)

;;; Org-mode (personal information manager)
(use-package org
  :ensure nil
  :init
  (setq org-imenu-depth 7)

  (add-to-list 'safe-local-variable-values '(org-hide-leading-stars . t))
  (add-to-list 'safe-local-variable-values '(org-hide-macro-markers . t))
  :bind
  ( :map global-map
    ("C-c l" . org-store-link) ; 存储当前连接
    ("C-c o" . org-open-at-point-global)
    :map org-mode-map
    ("C-c M-l" . org-insert-last-stored-link) ; 插入最近存储的连接
    ("C-c C-M-l" . org-toggle-link-display) ; 显示连接内容
    :map ctl-x-x-map
    ("i" . j-org-id-headlines) ; 为标题创建属性CUSTOM_ID
    ("h" . j-org-ox-html)      ; org导出为html
    ))
;;;; links
(use-package org
  :ensure nil
  :config
  (require 'j-org) ; for the above commands

  (setq org-link-context-for-files t)
  (setq org-link-keep-stored-after-insertion nil)
  (setq org-id-link-to-org-use-id 'create-if-interactive-and-no-custom-id))

;;;; code blocks
(use-package org
  :ensure nil
  :config
  ;;(setq org-confirm-babel-evaluate nil)             ; 使用Babel执行代码块时, 是否弹出确认对话框. nil 禁止弹出, 默认t弹出
  ;;(setq org-src-window-setup 'current-window)       ; 源代码窗口的布局位置. 默认 'reorganize-frame 侧边。 'current-window 当前窗口 
  ;;(setq org-edit-src-persistent-message nil)        ; 编辑源代码时显示持久的消息。nil 不显示, 默认 t
  ;;(setq org-src-fontify-natively t)                 ; 源代码本地高亮。默认t
  (setq org-src-preserve-indentation t)             ; 编辑源代码时保留原有的缩进，t代表启用该功能。默认nil不保留. 
  (setq org-src-tab-acts-natively t)                ; 源代码编辑模式下，Tab键的行为与原生代码编辑器一致，t代表启用该功能,  默认t
  (setq org-edit-src-content-indentation 0))          ; 代码块里缩进，0不缩进，默认是2(重要)
#+end_src

*** =init-org.el= org todo
:PROPERTIES:
:CUSTOM_ID: h:org-todo
:END:

在我的学习文章提到过([[#h:0ef565c4-904d-4863-9c8b-7462407b2659][模块列表]])

#+begin_src emacs-lisp :tangle "lisp/init-org.el"

(with-eval-after-load 'org  ; 启动org文件时加载
  ;; 自定义org todo  C-c C-t 
  (setq org-todo-keywords
	(quote ((sequence "TODO(t)" "STARTED(s)" "|" "DONE(d!/!)")
		(sequence "WAITING(w@/!)" "SOMEDAY(S)" "|" "CANCELLED(c@/!)" "MEETING(m)" "PHONE(p)"))))
)
#+end_src

以上代码让你在为一个标题提供待办事项状态时添加了一个键序列，你可以键入 =C-c C-t= 来查看效果。

其中 =@= 代表记录日志，而 =!= 代表记录时间戳，你也可以让他们具有两种功能: =TODO(t@/!)=

*任务进度* ：

创建文件 =~/gtd.org=
#+begin_src org
,* WAITING Daily routine
- [ ] leetcode
- [ ] execrcise
#+end_src


#+begin_src org
,* TODO Daily routine [100%]
SCHEDULED: <2022-06-10 Fri 10:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-06-09 Thu 02:31]
:END:
- State "DONE"       from "TODO"       [2022-06-09 Thu 02:31]
- State "TODO"       from "WAITING"    [2022-06-09 Thu 02:26]
- [X] leetcode
- [X] execrcise
#+end_src

- =C-c C-s= 开始计划： =<2022-06-09 Thu 10:00>= 10点
  
- 每天 10 点做：需要 =+d= 加一天 =SCHEDULED: <2022-06-09 Thu 10:00 +1d>= ，后面在 agenda 中会用到
  
- 完成情况进度：每一项任务使用复选框，todo 部分加 =[%]= ，复选框使用 =C-c C-c= 打 叉 表示完成。

标记完成：=C-c C-t d= ，可以看到 =SCHEDULED= 时间自动加 1 =SCHEDULED: <2022-06-10 Fri 10:00 +1d>=

#+begin_src org
,* TODO Daily routine [100%]
SCHEDULED: <2022-06-10 Fri 10:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-06-09 Thu 02:31]
:END:
- State "DONE"       from "TODO"       [2022-06-09 Thu 02:31]
- State "TODO"       from "WAITING"    [2022-06-09 Thu 02:26]
- [X] leetcode
- [X] execrcise
#+end_src

不过进入新的计划，每一项还需要新状态。这很麻烦，所以这边用另一个插件包 org-contrib。
目的是要引入 check list

#+begin_src emacs-lisp :tangle "lisp/init-org.el"
(with-eval-after-load 'org
  ;; 引入checklist, 自动更新状态
  ;; org-set-property 添加 RESET_CHECK_BOXS, 设置为t
  (require 'org-checklist)
  ;; need repeat task and properties
  (setq org-log-done t)
  (setq org-log-into-drawer t)

)
#+end_src

通过 =M-x org-set-property=  添加 =RESET_CHECK_BOXES= 。 =RESET_CHECK_BOXES=  设置为 =t= 开启， 会在 =PROPERTIES= 中增加属性。

当 =C-c C-t d= 把标题设置为 DONE，自动进入下一个时间点。 这对自定义一些重复性工作比较方便。


#+begin_src org
,* TODO Daily routine [0%]
SCHEDULED: <2022-06-15 Wed 10:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-06-09 Thu 07:24]
:RESET_CHECK_BOXES: t
:END:
- State "DONE"       from "TODO"       [2022-06-09 Thu 07:24]
- State "DONE"       from "TODO"       [2022-06-09 Thu 02:31]
- State "TODO"       from "WAITING"    [2022-06-09 Thu 02:26]
- [ ] leetcode
- [ ] execrcise
#+end_src

每次完成任务会自动插入完成状态，使用下面设置可以隐藏到 =PROPERTIES= 里：
#+begin_src emacs-lisp :tangle no
;; need repeat task and properties
(setq org-log-done t)
(setq org-log-into-drawer t)
#+end_src

使用 =C-c C-t d= 完成任务， 完成状态会增加到 =LOGBOOK= 属性中。把之前的状态手动移过来。
#+begin_src org
,* TODO Daily routine [0%]
SCHEDULED: <2022-06-17 Fri 10:00 +1d>
:PROPERTIES:
:LAST_REPEAT: [2022-06-09 Thu 07:44]
:RESET_CHECK_BOXES: t
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-06-09 Thu 07:44]
- State "DONE"       from "TODO"       [2022-06-09 Thu 07:34]
- State "DONE"       from "TODO"       [2022-06-09 Thu 07:24]
- State "DONE"       from              [2022-06-09 Thu 03:03]
- State "DONE"       from              [2022-06-09 Thu 02:50]
- State "DONE"       from "TODO"       [2022-06-09 Thu 02:31]
- State "TODO"       from "WAITING"    [2022-06-09 Thu 02:26]  
:END:
- [ ] leetcode
- [ ] execrcise
#+end_src

*** =init-org.el= org agenda
:PROPERTIES:
:CUSTOM_ID: h:org-agenda
:END:


相当于有一个日历实时告诉你每天要做什么。通过 =M-x org-agenda= 来打开. 这里需要一个存放日程的目录，同时绑定快捷键 =C-c a= 方便查看。


#+begin_src emacs-lisp :tangle "lisp/init-org.el"
;;; 日历
;; C-c C-s schedule
;; C-c C-d deadline
(global-set-key (kbd "C-c a") 'org-agenda)
(setq org-agenda-files '("~/gtd.org")) ;; 定义 agenda 文件，可以是多个
(setq org-agenda-span 'day) ;; 按天观察
#+end_src

基本操作：
- =C-c a a=  可以看到每周日程。
- =f/b= 下一个/上一个阶段安排, =d/w= 天/周视图，=n/p= 上/下移动光标 
- 在 =~/gtd.org= 设置 deadline =C-c C-d= ，在日程中也能看到。
  
