emacs/.emacs.d/jasper-emacs.org
*** =init-persp.el= 工作区间 =tabspaces=
:PROPERTIES:
:CUSTOM_ID: h:persp-tabspaces
:END:


#+begin_src emacs-lisp :tangle "lisp/init-persp.el"
(use-package tabspaces
  ;; use this next line only if you also use straight, otherwise ignore it.
  :ensure t
  :hook (after-init . tabspaces-mode) ;; use this only if you want the minor-mode loaded at startup.
  :defer t
  :commands (tabspaces-switch-or-create-workspace
             tabspaces-open-or-create-project-and-workspace)
  :custom
  (tabspaces-use-filtered-buffers-as-default t)
  (tabspaces-default-tab "Default")
  (tabspaces-remove-to-default t)
  (tabspaces-include-buffers '("*scratch*"))
  ;; maybe slow 关闭emacs后自动恢复工作空间。怕影响性能可以注释掉
  ;;(tabspaces-session t)
  ;;(tabspaces-session-auto-restore t)
  :config
  ;; Filter Buffers for Consult-Buffer

  (with-eval-after-load 'consult
    ;; hide full buffer list (still available with "b" prefix)
    (consult-customize consult--source-buffer :hidden nil :default nil)
    ;; set consult-workspace buffer list
    (defvar consult--source-workspace
      (list :name "Workspace Buffers"
            :narrow ?w
            :history 'buffer-name-history
            :category 'buffer
            :state #'consult--buffer-state
            :default t
            :items (lambda () (consult--buffer-query
                               :predicate #'tabspaces--local-buffer-p
                               :sort 'visibility
                               :as #'buffer-name)))

      "Set workspace buffer list for consult-buffer.")
    (add-to-list 'consult-buffer-sources 'consult--source-workspace)))
#+end_src

重启或执行 =M-x tabspaces-mode= 生效。

=C-x b= 打开缓冲区，发现多了一个 =Workspace Buffer= ，这里的buffer优先使用。


*按键绑定*

#+begin_src emacs-lisp :tangle no
(+general-global-menu! "layout" "l"
  "l" 'tabspaces-switch-or-create-workspace
  "L" 'tabspaces-restore-session
  "p" 'tabspaces-open-or-create-project-and-workspace
  "f" 'tabspaces-project-switch-project-open-file
  "s" 'tabspaces-save-session
  "B" 'tabspaces-switch-buffer-and-tab
  "b" 'tabspaces-switch-to-buffer
  "R" 'tab-rename
  "TAB" 'tab-bar-switch-to-recent-tab
  "r" 'tabspaces-remove-current-buffer
  "k" 'tabspaces-close-workspace)
#+end_src

*工作流*

每一个工作空间都可以有布局



#+begin_src emacs-lisp :tangle "lisp/init-persp.el"
(message "Load init-persp done...")
(provide 'init-persp)
#+end_src

** =init-programming.el=
:PROPERTIES:
:CUSTOM_ID: h:48550b88-bb99-44c6-a4a3-2442cc2d0443
:END:

*** =init-programming.el= c++
:PROPERTIES:
:CUSTOM_ID: h:c++
:END:

**** =init-programming.el= 代码编写 =eglot=
:PROPERTIES:
:CUSTOM_ID: h:c++-eglot
:END:

在我的学习文章提到过([[#h:0ef565c4-904d-4863-9c8b-7462407b2659][模块列表]])

使用 eglot 来编写、运行和调试 C/C++ 代码

*安装 mysys2*

1.下载 https://www.msys2.org/

2.安装 C/C++ 必要的软件工具

#+begin_src sh :tangle no :results none
#安装c++必要软件 gcc gdb make clang clang-tool
pacman -Syu
pacman -S mingw-w64-x86_64-gcc mingw-w64-x86_64-gdb make mingw-w64-x86_64-clang mingw-w64-x86_64-clang-tools-extra
#+end_src

3.设置环境变量
#+begin_example
d:\msys64\mingw64\bin
d:\msys64\usr\bin
#+end_example

*安装 eglot(Emacs 29 自带 eglot)*


#+begin_src emacs-lisp :tangle "lisp/init-programming.el" :mkdirp yes
;;; c++ eglot
(require 'eglot)
(add-to-list 'eglot-server-programs '((c++-mode c-mode) "clangd"))
(add-hook 'c-mode-hook #'eglot-ensure)
(add-hook 'c++-mode-hook #'eglot-ensure)
#+end_src

测试一段c++代码

=~/test.cpp=
在emacs菜单栏flymake可以列出所有问题

*一键运行代码*

1.安装 quickrun:

可以运行任意一个单文件程序
#+begin_src emacs-lisp :tangle "lisp/init-programming.el"
;; 运行任意单文件程序 快捷键F5
(use-package quickrun
  :ensure t
  :commands (quickrun)
  :init
  (quickrun-add-command "c++/c1z"
    '((:command . "g++")
      (:exec . ("%c -std=c++1z %o -o %e %s"
                "%e %a"))
      (:remove . ("%e")))
    :default "c++"))
(global-set-key (kbd "<f5>") 'quickrun)
#+end_src

*使用 gdb 调试*

1. 运行 =M-x compile=, 输入 g++ -g -o test.o test.cpp #-g编译时生成调试信息
2. 使用 =M-x gud-gdb= 输入 gdb ./test.o
3. 常用调试命令

| name            | function                                            |
| list            | 显示源代码                                           |
| break           | 新增断点， break main, break 12（行号）               |
| info            | 查看断点或者局部变量信息 info breakpoints, info locals |
| run             | 开始调试                                             |
| next            | 类似 step over                                      |
| step            | 跳转到函数内部                                       |
| continue        | 继续运行到下一个断点                                  |
| quit            | 退出调试                                             |
| watch           | 内存断点                                             |
| display         | 类似 IDE 里面的 watch 功能                           |
| break 11 if xxx | 条件断点                                             |


- list 显示源代码
- break 11 在第11行打断点
- break 12 在第12行打断点.
  - 如果有函数名add，也可以给函数下断点 b add;
  - 条件断点 b 20 if i == 2500 在第20行i等于时加断点
- info breakpoints 查看断点信息
- run 调试，程序停在第一个断点位置
- print myVec的值
- next下一个
- print myVec的值,发生变化
- continue 运行到下一个断点

#+begin_example
(gdb) list
1	#include<iostream>
2	#include<iterator>
3	#include<vector>
4	
5	using namespace std;
6	
7	int main()
8	{
9	  vector<int> myVec;
10	  myVec.push_back(2);
(gdb) 
11	  myVec.push_back(3);
12	  cout << "Hello World"<<endl;
13	  
14	  cout <<"vect size: "<<myVec.size() <<endl;
15	  return 0;
16	}
(gdb) break 11
Breakpoint 1 at 0x140001483: file test.cpp, line 11.
(gdb) break 12
Breakpoint 2 at 0x14000149a: file test.cpp, line 12.
(gdb) info breakpoints
Num     Type           Disp Enb Address            What
1       breakpoint     keep y   0x0000000140001483 in main() at test.cpp:11
2       breakpoint     keep y   0x000000014000149a in main() at test.cpp:12
(gdb) run
Starting program: d:\tmp\emacs\test.o 
[New Thread 7812.0x4d34]
[New Thread 7812.0x4864]
[New Thread 7812.0x3bdc]

Thread 1 hit Breakpoint 1, main () at test.cpp:11
11	  myVec.push_back(3);
(gdb) print myVec
$1 = std::vector of length 1, capacity 1 = {2}
(gdb) next

Thread 1 hit Breakpoint 2, main () at test.cpp:12
12	  cout << "Hello World"<<endl;
(gdb) print myVec
$2 = std::vector of length 2, capacity 2 = {2, 3}
(gdb) continue
Continuing.
Hello World
vect size: 2
[Thread 7812.0x4d34 exited with code 0]
[Thread 7812.0x4864 exited with code 0]
[Thread 7812.0x3bdc exited with code 0]
[Inferior 1 (process 7812) exited normally]
(gdb) 
#+end_example

使用 Treesit + eglot 来打造现代编程 IDE

Emacs29新特性介绍：<https://emacs.liujiacai.net/post/031-emacs-29-feature-preview/>

**** =init-programming.el= 语法高亮 =treesit-auto=
:PROPERTIES:
:CUSTOM_ID: h:c++-treesit-auto
:END:

在我的学习文章提到过([[#h:0ef565c4-904d-4863-9c8b-7462407b2659][模块列表]])

https://github.com/renzmann/treesit-auto

语法高亮, =*ts-mode= , 性能要比原生的好。

#+begin_src emacs-lisp :tangle "lisp/init-programming.el"
;;; treesit-auto
;; 语法高亮, *ts-mode , M-x treesit-auto-install-all
(use-package treesit-auto
  :ensure t
  :demand t
  :config
  (setq treesit-auto-install 'prompt)
  (global-treesit-auto-mode))
#+end_src

安装完之后运行 =M-x treesit-auto-install-all= , 它自动下载编译好的各种语言 =.dll= 文件, 文件安装在 =~/.emacs.d/tree-sitter=

重启emacs，打开一个c++程序，查看当前的主模式 =C-h v= major=mode 可以看到是 =c++-ts-mode= ，而不是原先的 =c++-mode=

默认情况下，treesit会对所有语言做映射 =*ts.mode=, 如果需要指定某些语言不映射，可这样写

#+begin_src emacs-lisp :tangle no
(use-package treesit-auto
  :ensure t
  :demand t
  :config
  (progn
  (setq treesit-font-lock-level 4) ; 任意能高亮的都高亮
  (add-to-list 'major-mode-remap-alist '(c++-mode . c++-ts-mode)) ;指定不映射
  )
  :config
  (global-treesit-auto-mode)
  )
#+end_src

**** =init-programming.el= 跳转函数列表 consult-imenu
:PROPERTIES:
:CUSTOM_ID: h:c++-consult-imenu
:END:

在学习章节提到过[[h:learn-c++-treesit][(使用 Treesit + eglot 来打造现代编程 IDE)]]

#+begin_src emacs-lisp :tangle no :results none
(+general-global-menu! "search" "s"
  "j" 'consult-imenu
  "p" 'consult-ripgrep
  "k" 'consult-keep-lines
  "f" 'consult-focus-lines)
#+end_src

上面配置在我的emacs模块配置[[#h:keybindings-general][（=init-keybindings.el= 键位绑定 =general=）]]

修改了j对应自定义了my/imenu函数[[#h:j-consult][(=j-consult.el= 库)]]

范例：跳转函数列表操作
- =SPC s j= 跳转函数列表

**** =init-programming.el= 查找定义和引用
:PROPERTIES:
:CUSTOM_ID: h:2be86b5f-655e-4bd6-b2a8-c39eb68c690f
:END:

vim 模式是
- gd 跳转函数定义
- gr 查找函数引用
- C-o 返回

使用 ctrl-o 返回

#+begin_example :tangle no
(global-definer
  "gg" 'xref-find-definitions
  "gr" 'xref-find-references
#+end_example

**** =init-programming.el= 添加 snippets 支持
:PROPERTIES:
:CUSTOM_ID: h:0adb5e48-1781-4780-a991-0ac87c8ae529
:END:

#+begin_src emacs-lisp :tangle "lisp/init-programming.el"
(use-package yasnippet
  :ensure t
  :hook ((prog-mode . yas-minor-mode)
         (org-mode . yas-minor-mode))
  :init
  :config
  (progn
    (setq hippie-expand-try-functions-list
          '(yas/hippie-try-expand
            try-complete-file-name-partially
            try-expand-all-abbrevs
            try-expand-dabbrev
            try-expand-dabbrev-all-buffers
            try-expand-dabbrev-from-kill
            try-complete-lisp-symbol-partially
            try-complete-lisp-symbol))))

(use-package yasnippet-snippets
  :ensure t
  :after yasnippet)
#+end_src

自定义代码片段
- =M-x yas-new-snippet= 创建新代码片段
  #+begin_example
  # -*- mode: snippet -*-
  # name: <name>  指Snippet的名称
  # key: <key>  指Snippet的名称
  # contributor : Jasper Hsu <xcwhome@163.com>  作者信息
  # --
  `(message "hello from my yasnippet")`$0
  Hello ${1:world)
  #+end_example

  =$0= 光标位置， =$1..n= 使用tab, shift-tab切换占位符位置，可以设置默认值如 =${1:aa}=

  =`()`= 可以写lisp语法
- =C-c C-c=完成编程，选择片段生效的模式，保存指定位置 =~/.emacs.d/snippets/<xxx>-mode/<name>=
- =M-x yas-describe-tables= 查看
- =M-x yas-visit-snippet-file= 编辑

**** =init-programming.el= 在头文件和源文件之间进行跳转
:PROPERTIES:
:CUSTOM_ID: h:cc34dec7-c21d-47ef-8cc1-519de991bd8d
:END:

ff-find-related-file




#+begin_src emacs-lisp :tangle "lisp/init-programming.el"
(message "Load init-programming done...")
(provide 'init-programming)
#+end_src

** =init-keybindings.el=
:PROPERTIES:
:CUSTOM_ID: h:696bce89-99d1-4716-80c0-cf1b36844fa8
:END:

*** =init-keybindings.el= 文件搜索
:PROPERTIES:
:CUSTOM_ID: h:keybindings-search-file
:END:

配置划分成不同文件，好以后方式方便查找

#+begin_src emacs-lisp :tangle "lisp/init-keybindings.el" :mkdirp yes
;;; config
;;; 文件搜索
(global-set-key (kbd "C-c p f") 'project-find-file) ;;   查找文件，默认绑定在 C-x p f
(global-set-key (kbd "C-c p s") 'consult-ripgrep)  ;;  查找文件内容
#+end_src

C-c 是给用户定义的快捷键，p 代表 project ， f 代表 find-file

consult-ripgrep 需要安装 consult 和 ripgrep ， 方便查找关键字

操作：快速找到文件
- =C-c p f= 选择目标目录, 回车 如 =~/.emacs.d=
- 输入要查找文件名对应的关键字符，即可打开文件。 如打开 =~/.emacs.d/lisp/init-basic.el= 文件， 输入basic即可

