emacs/.emacs.d/lisp/init-keybindings.el
;;; config

;;; 文件搜索
(global-set-key (kbd "C-c p f") 'project-find-file) ;;   查找文件，默认绑定在 C-x p f
(global-set-key (kbd "C-c p s") 'consult-ripgrep)  ;;  查找文件内容

(use-package general
  :init
