emacs/.emacs.d/jasper-emacs.org
** =j-org.el= 库
:PROPERTIES:
:CUSTOM_ID: h:j-org
:END:



#+begin_src emacs-lisp :tangle "j-lisp/j-org.el"
;;; j-org.el --- Extensions for org -*- lexical-binding: t -*-

;; Copyright (C) 2024  Jasper Hsu

;; Author: Jasper Hsu <xcwhome@163.com>
;; URL: https://xuchangwei.com/lisp/jasper-emacs.html
;; Version: 0.1.0
;; Package-Requires: ((emacs "30.1"))

;; This file is NOT part of GNU Emacs.

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or (at
;; your option) any later version.
;;
;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

;;; Commentary:
;;
;; Remember that every piece of Elisp that I write is for my own
;; educational and recreational purposes.  I do not recommend that
;; you copy any of this if you are not certain of what it does.

;;; Code:

;;;; org-export

(declare-function org-html-export-as-html "org")
(declare-function org-texinfo-export-to-info "org")

;;;###autoload
(defun j-org-ox-html ()
  "导出为html
Streamline HTML export."
  (interactive)
  (org-html-export-as-html nil nil nil t nil))

;;;###autoload
(defun j-org-ox-texinfo ()
  "导出Info
Streamline Info export."
  (interactive)
  (org-texinfo-export-to-info))

;;;; org-id

(declare-function org-id-add-location "org")
(declare-function org-with-point-at "org")
(declare-function org-entry-get "org")
(declare-function org-id-new "org")
(declare-function org-entry-put "org")

;; Original idea:
;; <https://writequit.org/articles/emacs-org-mode-generate-ids.html>.
(defun j-org--id-get ()
  "获取当前的CUSTOM_ID
Get the CUSTOM_ID of the current entry.
If the entry already has a CUSTOM_ID, return it as-is, else
create a new one."
  (let* ((pos (point))
         (id (org-entry-get pos "CUSTOM_ID")))
    (if (and id (stringp id) (string-match-p "\\S-" id))
        id
      (setq id (org-id-new "h"))
      (org-entry-put pos "CUSTOM_ID" id)
      id)))

(declare-function org-map-entries "org")

;;;###autoload
(defun j-org-id-headlines ()
  "添加CUSTOM_ID
Add missing CUSTOM_ID to all headlines in current file."
  (interactive)
  (org-map-entries
   (lambda () (j-org--id-get))))

;;;###autoload
(defun j-org-id-headline ()
  "Add missing CUSTOM_ID to headline at point."
  (interactive)
  (j-org--id-get))

(provide 'j-org)
;;; j-org.el ends here
#+end_src

** =j-emacs-fast.el= 库
:PROPERTIES:
:CUSTOM_ID: h:j-emacs-fast
:END:


#+begin_src emacs-lisp :tangle "j-lisp/j-emacs-fast.el"
;;; j-emacs-fast.el --- Extensions for org -*- lexical-binding: t -*-

;; Copyright (C) 2024  Jasper Hsu

;; Author: Jasper Hsu <xcwhome@163.com>
;; URL: https://xuchangwei.com/lisp/jasper-emacs.html
;; Version: 0.1.0
;; Package-Requires: ((emacs "30.1"))

;; This file is NOT part of GNU Emacs.

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or (at
;; your option) any later version.
;;
;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

;;; Commentary:
;;
;; Remember that every piece of Elisp that I write is for my own
;; educational and recreational purposes.  I do not recommend that
;; you copy any of this if you are not certain of what it does.

;;; Code:

;;;; 放置一些快捷使用emacs函数

;;; Dos2Unix/Unix2Dos
(defun fast/dos2unix ()
  "Convert the current buffer to UNIX file format."
  (interactive)
  (set-buffer-file-coding-system 'undecided-unix nil))

(defun fast/unix2dos ()
  "Convert the current buffer to DOS file format."
  (interactive)
  (set-buffer-file-coding-system 'undecided-dos nil))


;;; 文件操作
(defun fast/open-my-init-file()
  "快速打开主配置文件"
  (interactive)
  (find-file (expand-file-name "init.el" user-emacs-directory )))

(defun fast/copy-file-name ()
  "复制文件绝对路径，使用 =C-y= 粘贴
Copy the current buffer file name to the clipboard."
  (interactive)
  (if-let ((filename (if (equal major-mode 'dired-mode)
                         default-directory
                       (buffer-file-name))))
      (progn
        (kill-new filename)
        (message "Copied '%s'" filename))
    (warn "Current buffer is not attached to a file!")))

;;; buffer缓冲区
(defun fast/copy-buffer-name ()
  "复制缓冲区名
Copy name of the current buffer."
  (interactive)
  (kill-new (buffer-name)))

(defun fast/kill-other-buffers ()
  "杀掉其他缓冲区
Kill all other buffers."
  (interactive)
  (mapc 'kill-buffer
        (delq (current-buffer)
              (cl-remove-if-not 'buffer-file-name (buffer-list)))))

;;; 返回上一个buffer
(defun spacemacs/alternate-buffer (&optional window)
  "Switch back and forth between current and last buffer in the
current window.
If `spacemacs-layouts-restrict-spc-tab' is `t' then this only switches between
the current layouts buffers."
  (interactive)
  (cl-destructuring-bind (buf start pos)
      (if (bound-and-true-p spacemacs-layouts-restrict-spc-tab)
          (let ((buffer-list (persp-buffer-list))
                (my-buffer (window-buffer window)))
            ;; find buffer of the same persp in window
            (seq-find (lambda (it) ;; predicate
                        (and (not (eq (car it) my-buffer))
                             (member (car it) buffer-list)))
                      (window-prev-buffers)
                      ;; default if found none
                      (list nil nil nil)))
        (or (cl-find (window-buffer window) (window-prev-buffers)
                     :key #'car :test-not #'eq)
            (list (other-buffer) nil nil)))
    (if (not buf)
        (message "Last buffer not found.")
      (set-window-buffer-start-and-point window buf start pos))))

(provide 'j-emacs-fast)
;;; j-emacs-fast.el ends here
#+end_src



* Emacs 配置问题排查
:PROPERTIES:
:CUSTOM_ID: h:43ed0760-cc70-475c-9da8-a9caa7f67657
:END:

配置最好用git管理起来。

** 配置有问题，启动不了怎么办？
:PROPERTIES:
:CUSTOM_ID: h:2fee1b0f-3633-4d2c-9301-8b08562a07aa
:END:

#+begin_src sh
emacs-debug –init
#+end_src

** 不能安装包，提示签名错误
:PROPERTIES:
:CUSTOM_ID: h:a95b56f5-efc0-44a0-b9be-1a054b419bde
:END:

Failed to verify signature archive-contents.sig

#+begin_example
(setq package-check-signature nil)
#+end_example

** 包解压失败，
:PROPERTIES:
:CUSTOM_ID: h:1576a87a-4eda-419a-8e88-46629c6044a4
:END:

a pax extended header, 包解压失败，可以使用 use-package :vc 直接安装

使用 mysys2 的时候，系统会使用 unix 的 tar 去解压会有问题 windows 上面需要使用 system32/tar 这个程序去解压。

解决办法可以是
#+begin_src  sh :tangle no
mv /usr/bin/tar /usr/bin/tarbak
#+end_src


* 优化性能，借鉴其他人的配置
:PROPERTIES:
:CUSTOM_ID: h:fcadef90-7310-40d6-aaa0-de74737e0940
:END:

how to Profile performace

** 运行时性能
:PROPERTIES:
:CUSTOM_ID: h:558eed58-5e30-476b-acd3-ad1a46949b1b
:END:

- =M-x profiler-start= 选择cpu+mem
- 复现卡的操作。比如光标移动卡顿，反复重现
- =M-x profiler-report= 打开报告，分析

** 度量启动性能
:PROPERTIES:
:CUSTOM_ID: h:da6bbc1a-043f-45e9-8aca-f565c8454588
:END:

#+begin_src emacs-lisp :tangle no
(use-package benchmark-init
  :ensure t
  :demand t
  :config
  ;; To disable collection of benchmark data after init is done.
  (add-hook 'after-init-hook 'benchmark-init/deactivate))
#+end_src

- =benchmark-init/show-durations-tree= 树状展示耗时
- =benchmark-init/show-durations-tabulated= 排序展示， 鼠标点击字段进行排序。 分析

启动时间
#+begin_src emacs-lisp :tangle no
(defun efs/display-startup-time ()
  (message "启动加载时间Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                   (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'efs/display-startup-time)
#+end_src

减小gc次数
- 在开始加载时gc设置大些，加载完成后gc调小

#+begin_src emacs-lisp :tangle no
;;; beginning of init.el
;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

;; ................

;;; end of init.el
;; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 2 1000 1000))
#+end_src

不要加载任何包裹！ 

use-package 哪些操作可以优化性能, 几种不同的方法来延迟包加载：
- :hook - 首次调用其中一个钩子时，将加载包
- :bind - 首次使用其中一个键绑定时，将加载包
- :commands - 当使用其中一个命令时，将加载包
- :mode - 首次打开具有特定扩展名的文件时，将加载包
- :after - 在其他特定包加载后加载此包
- :defer - 如果您不使用任何其他选项，则此选项将延迟加载到启动后

<https://systemcrafters.net/emacs-from-scratch/cut-start-up-time-in-half/>

** 借鉴大佬的配置，作为框架
:PROPERTIES:
:CUSTOM_ID: h:d923bc80-6e8b-4832-b177-156188d0cdad
:END:

社区配置

Spacemacs & DoomEmacs

个人配置
- https://github.com/purcell/emacs.d
- https://github.com/bbatsov/prelude
- https://github.com/bbatsov/prelude
- https://github.com/seagle0128/.emacs.d
- https://github.com/zilongshanren/emacs.d （子龙山人）

